
#include "src/list.h"

namespace Pt
{

List::List()
{
    Init();
}

List::~List()
{
}

List &List::Get()
{
    static List list;
    return list;
};

void List::Init()
{
    pageList.clear();
    izeArrayList.clear();
    adventureList.clear();
    miniGamesList.clear();
    puzzleList.clear();
    survivalList.clear();
    damageList.clear();
    hpList.clear();
    coinList.clear();
    timeList.clear();
    blockTypeList.clear();
    rowTypeList.clear();
    sceneList.clear();
    musicList.clear();
    itemList.clear();
    zombieStatusList.clear();
    zombieList.clear();
    slotsIndexList.clear();
    seedList.clear();
    rowList.clear();
    gardenHeadersList.clear();
    gardenSceneList.clear();
    directionList.clear();
    colorList.clear();
    plantStatusList.clear();
    vaseHeadersList.clear();
    vaseSkinList.clear();
    vaseTypeList.clear();
    debugModeList.clear();
    endlessBuildNameList.clear();
    endlessBuildStringList.clear();

    pageList
        << tr("Level")
        << tr("Resources")
        << tr("Plants")
        << tr("Zombies")
        << tr("Spawn")
        << tr("Slots")
        << tr("Scene")
        << tr("Lineup")
        << tr("Garden")
        << tr("Vase")
        << tr("Effects")
        << tr("Others")
        << tr("Status");

    izeArrayList
        << tr("Peashooter")
        << tr("Chomper") + " " + tr("Potato Mine")
        << tr("Spikeweed") + " " + tr("Starfruit")
        << tr("Fume-shroom") + " " + tr("Magnet-shroom")
        << tr("Scaredy-shroom")
        << tr("Hodgepodge") + "1"
        << tr("Hodgepodge") + "2"
        << tr("Hodgepodge") + "3";

    adventureList
        << "1-1"
        << "1-2"
        << "1-3"
        << "1-4"
        << "1-5"
        << "1-6"
        << "1-7"
        << "1-8"
        << "1-9"
        << "1-10"
        << "2-1"
        << "2-2"
        << "2-3"
        << "2-4"
        << "2-5"
        << "2-6"
        << "2-7"
        << "2-8"
        << "2-9"
        << "2-10"
        << "3-1"
        << "3-2"
        << "3-3"
        << "3-4"
        << "3-5"
        << "3-6"
        << "3-7"
        << "3-8"
        << "3-9"
        << "3-10"
        << "4-1"
        << "4-2"
        << "4-3"
        << "4-4"
        << "4-5"
        << "4-6"
        << "4-7"
        << "4-8"
        << "4-9"
        << "4-10"
        << "5-1"
        << "5-2"
        << "5-3"
        << "5-4"
        << "5-5"
        << "5-6"
        << "5-7"
        << "5-8"
        << "5-9"
        << "5-10";

    miniGamesList
        << tr("ZomBotany")                  // 16
        << tr("Wall-nut Bowling")           // 17
        << tr("Slot Machine")               // 18
        << tr("It's Raining Seeds")         // 19
        << tr("Beghouled")                  // 20
        << tr("Invisi-ghoul")               // 21
        << tr("Seeing Stars")               // 22
        << tr("Zombiquarium")               // 23
        << tr("Beghouled Twist")            // 24
        << tr("Big Trouble Little Zombie")  // 25
        << tr("Portal Combat")              // 26
        << tr("Column Like You See'Em")     // 27
        << tr("Bobseld Bonanza")            // 28
        << tr("Zombie Nimble Zombie Quick") // 29
        << tr("Whack a Zombie")             // 30
        << tr("Last Stand")                 // 31
        << tr("ZomBotany 2")                // 32
        << tr("Wall-nut Bowling 2")         // 33
        << tr("Pogo Party")                 // 34
        << tr("Dr. Zomboss's Revenge")      // 35
        << tr("Art Challenge Wall-nut")     // 36
        << tr("Sunny Day")                  // 37
        << tr("Unsodded (FC)")              // 38
        << tr("Big Time")                   // 39
        << tr("Art Challenge Sunflower")    // 40
        << tr("Air Raid")                   // 41
        << tr("Ice Level")                  // 42
        << tr("Zen Garden (FC)")            // 43
        << tr("High Gravity")               // 44
        << tr("Grave Danger")               // 45
        << tr("Can You Dig It?")            // 46
        << tr("Dark Stormy Night")          // 47
        << tr("Bungee Blitz")               // 48
        << tr("Squirrel")                   // 49
        << tr("Tree of Wisdom");            // 50

    puzzleList
        << tr("Vasebreaker")                    // 51
        << tr("To the Left")                    // 52
        << tr("Third Vase")                     // 53
        << tr("Chain Reaction")                 // 54
        << tr("M is for Metal")                 // 55
        << tr("Scary Potter")                   // 56
        << tr("Hokey Pokey")                    // 57
        << tr("Another Chain Reaction")         // 58
        << tr("Ace of Vase")                    // 59
        << tr("Vasebreaker Endless")            // 60
        << tr("I, Zombie")                      // 61
        << tr("I, Zombie Too")                  // 62
        << tr("Can You Dig It?")                // 63
        << tr("Totally Nuts")                   // 64
        << tr("Dead Zeppelin")                  // 65
        << tr("Me Smash!")                      // 66
        << tr("ZomBoogie")                      // 67
        << tr("Three Hit Wonder")               // 68
        << tr("All your brainz r belong to us") // 69
        << tr("I, Zombie Endless")              // 70
        << tr("Upsell")                         // 71
        << tr("Intro");                         // 72

    survivalList
        << tr("Survival: Day")             // 1
        << tr("Survival: Night")           // 2
        << tr("Survival: Pool")            // 3
        << tr("Survival: Fog")             // 4
        << tr("Survival: Roof")            // 5
        << tr("Survival: Day (Hard)")      // 6
        << tr("Survival: Night (Hard)")    // 7
        << tr("Survival: Pool (Hard)")     // 8
        << tr("Survival: Fog (Hard)")      // 9
        << tr("Survival: Roof (Hard)")     // 10
        << tr("Survival: Day (Endless)")   // 11
        << tr("Survival: Night (Endless)") // 12
        << tr("Survival: Endless")         // 13
        << tr("Survival: Fog (Endless)")   // 14
        << tr("Survival: Roof (Endless)"); // 15

    damageList
        << tr("Pea")
        << tr("Frozen Pea")
        << tr("Cabbage")
        << tr("Melon")
        << tr("Fume")
        << tr("Winter Melon")
        << tr("Fireball")
        << tr("Star")
        << tr("Spike")
        << tr("Basketball")
        << tr("Kernel")
        << tr("Butter")
        << tr("Zombie Pea")
        << tr("Ash")
        << tr("Potato Mine")
        << tr("Ice-shroom")
        << tr("Squash")
        << tr("Bite");

    hpList
        << tr("Plant", "Normal Plant")
        << tr("Wall-nut")
        << tr("Tall-nut")
        << tr("Pumpkin")
        << tr("Garlic")
        << tr("Spikerock")
        << tr("Zombie", "Normal Zombie")
        << tr("Conehead Zombie") // 7 路障
        << tr("Pole Vaulting Zombie")
        << tr("Buckethead Zombie")  // 9 铁桶
        << tr("Newspaper Zombie")   // 10 报纸
        << tr("Screen Door Zombie") // 11 铁栅门
        << tr("Football Zombie")    // 12 橄榄球帽
        << tr("Dancing Zombie")
        << tr("Zomboni")
        << tr("Dolphin Rider Zombie")
        << tr("Jack-in-the-Box Zombie")
        << tr("Digger Zombie") // 17 矿工帽
        << tr("Pogo Zombie")
        << tr("Zombie Yeti")
        << tr("Bungee Zombie")
        << tr("Ladder Zombie") // 21 扶梯
        << tr("Gargantuar")
        << tr("Dr. Zomboss")
        << tr("Dr. Zomboss Extra")
        << tr("Wall-nut Zombie") // 25 僵尸坚果
        << tr("Jalapeno Zombie")
        << tr("Tall-nut Zombie") // 27 僵尸高坚果
        << tr("GigaGargantuar")
        << tr("Imp in I, Zombie")
        << tr("Balloon"); // 30 气球

    coinList
        << tr("Silver Coin")
        << tr("Gold Coin")
        << tr("Diamond")
        << tr("Sun")
        << tr("Small Sun")
        << tr("Big Sun")
        // << "7"
        // << "8"
        // << "9"
        // << "10"
        // << "11"
        // << "12"
        // << "13"
        // << "14"
        // << "15"
        // << "16"
        // << "17"
        // << "18"
        // << "19"
        // << "20"
        // << "21"
        // << "22"
        // << "23"
        // << "24"
        // << "25"
        // << "26"
        // << "27"
        ;

    timeList
        << tr("Fog Clear")
        << tr("Cherry Bomb / Jalapeno")
        << tr("Potato Mine")
        << tr("Chomper")
        << tr("Sun-shroom")
        << tr("Ice-shroom")
        << tr("Doom-shroom")
        << tr("Blover")
        << tr("Magnet-shroom")
        << tr("Cob Cannon Filling")
        << tr("Backup Dancer Call")
        << tr("Zombie Yeti Run Away")
        << tr("Bungee Zombie Stay");

    blockTypeList
        << tr("Lawn")
        << tr("Bare")
        << tr("Pool");

    rowTypeList
        << tr("None")
        << tr("Land")
        << tr("Water");

    sceneList
        << tr("Day")
        << tr("Night")
        << tr("Pool")
        << tr("Fog")
        << tr("Roof")
        << tr("Moon")
        << tr("Mushroom Garden")
        << tr("Zen Garden")
        << tr("Aquarium Garden")
        << tr("Tree of Wisdom");

    musicList // keep original name
        << "Grasswalk"
        << "Moongrains"
        << "Watery Graves"
        << "Rigor Mormist"
        << "Graze the Roof"
        << "Choose Your Seeds"
        << "Crazy Dave"
        << "Zen Garden"
        << "Cerebrawl"
        << "Loonboon"
        << "Ultimate Battle"
        << "Brainiac Maniac";

    itemList
        << tr("Grave")        // 1
        << tr("Crater")       // 2
        << tr("Ladder")       // 3
        << tr("White Portal") // 4
        << tr("Black Portal") // 5
        << tr("Vase")         // 7
        << tr("Snail")        // 10
        << tr("Rake")         // 11
        << tr("Brain")        // 12
        << tr("Plants")
        << tr("Zombies");

    zombieStatusList
        << tr("Kill")
        << tr("Hypno")
        << tr("Freeze")
        << tr("Decelerate")
        << tr("Immobilize")
        << tr("Blow Away")
        << tr("Dying")
        << tr("Disappear")
        << tr("Black")
        << tr("Bigger");

    zombieList
        << tr("Zombie", "Zombie Zombie") // 0
        << tr("Flag Zombie")             // 1
        << tr("Conehead Zombie")         // 2
        << tr("Pole Vaulting Zombie")    // 3
        << tr("Buckethead Zombie")       // 4
        << tr("Newspaper Zombie")        // 5
        << tr("Screen Door Zombie")      // 6
        << tr("Football Zombie")         // 7
        << tr("Dancing Zombie")          // 8
        << tr("Backup Dancer")           // 9
        << tr("Ducky Tube Zombie")       // 10
        << tr("Snorkel Zombie")          // 11
        << tr("Zomboni")                 // 12
        << tr("Zombie Bobsled Team")     // 13
        << tr("Dolphin Rider Zombie")    // 14
        << tr("Jack-in-the-Box Zombie")  // 15
        << tr("Balloon Zombie")          // 16
        << tr("Digger Zombie")           // 17
        << tr("Pogo Zombie")             // 18
        << tr("Zombie Yeti")             // 19
        << tr("Bungee Zombie")           // 20
        << tr("Ladder Zombie")           // 21
        << tr("Catapult Zombie")         // 22
        << tr("Gargantuar")              // 23
        << tr("Imp")                     // 24
        << tr("Dr. Zomboss")             // 25
        << tr("Peashooter Zombie")       // 26
        << tr("Wall-nut Zombie")         // 27
        << tr("Jalapeno Zombie")         // 28
        << tr("Gatling Pea Zombie")      // 29
        << tr("Squash Zombie")           // 30
        << tr("Tall-nut Zombie")         // 31
        << tr("GigaGargantuar");         // 32

    slotsIndexList
        << tr("1st slot")
        << tr("2nd slot")
        << tr("3rd slot")
        << tr("4th slot")
        << tr("5th slot")
        << tr("6th slot")
        << tr("7th slot")
        << tr("8th slot")
        << tr("9th slot")
        << tr("10th slot");

    seedList
        << tr("Peashooter") // 0
        << tr("Sunflower")
        << tr("Cherry Bomb")
        << tr("Wall-nut")
        << tr("Potato Mine")
        << tr("Snow Pea")
        << tr("Chomper")
        << tr("Repeater")
        << tr("Puff-shroom")
        << tr("Sun-shroom")
        << tr("Fume-shroom")
        << tr("Grave Buster")
        << tr("Hypno-shroom")
        << tr("Scaredy-shroom")
        << tr("Ice-shroom")
        << tr("Doom-shroom")
        << tr("Lily Pad")
        << tr("Squash")
        << tr("Threepeater")
        << tr("Tangle Kelp")
        << tr("Jalapeno")
        << tr("Spikeweed")
        << tr("Torchwood")
        << tr("Tall-nut")
        << tr("Sea-shroom")
        << tr("Plantern")
        << tr("Cactus")
        << tr("Blover")
        << tr("Split Pea")
        << tr("Starfruit")
        << tr("Pumpkin")
        << tr("Magnet-shroom")
        << tr("Cabbage-pult")
        << tr("Flower Pot")
        << tr("Kernel-pult")
        << tr("Coffee Bean")
        << tr("Garlic")
        << tr("Umbrella Leaf")
        << tr("Marigold")
        << tr("Melon-pult")
        << tr("Gatling Pea")
        << tr("Twin Sunflower")
        << tr("Gloom-shroom")
        << tr("Cattail")
        << tr("Winter Melon")
        << tr("Gold Magnet")
        << tr("Spikerock")
        << tr("Cob Cannon") // 47
        << tr("Imitater")   // 48
        << tr("Explode-o-nut")
        << tr("Giant Wall-nut")
        << tr("Sprout")
        << tr("Reverse Repeater")
        << tr("Nothing (FC)")       // 53
        << tr("Shuffle plant (FC)") // 54
        << tr("Refill crator (FC)") // 55
        << tr("Sun (FC)")           // 56
        << tr("Diamond (FC)")       // 57
        << tr("Snorkel Zombie")
        << tr("Trophy")
        << tr("Zombie", "Zombie Zombie")
        << tr("Conehead Zombie")
        << tr("Pole Vaulting Zombie")
        << tr("Buckethead Zombie")
        << tr("Ladder Zombie")
        << tr("Digger Zombie")
        << tr("Bungee Zombie")
        << tr("Football Zombie")
        << tr("Balloon Zombie")
        << tr("Screen Door Zombie")
        << tr("Zomboni")
        << tr("Pogo Zombie")
        << tr("Dancing Zombie")
        << tr("Gargantuar")
        << tr("Imp")
        << tr("<Missing> (FC)"); // 75

    rowList
        << tr("All Rows")
        << tr("1st Row")
        << tr("2nd Row")
        << tr("3rd Row")
        << tr("4th Row")
        << tr("5th Row")
        << tr("6th Row");

    gardenHeadersList
        << tr("Index")
        << tr("Row")
        << tr("Column")
        << tr("Scene")
        << tr("Type")
        << tr("Direction")
        << tr("Color")
        << tr("Status", "grow up status");

    gardenSceneList
        << tr("Zen Garden")
        << tr("Mushroom Garden")
        << tr("Wheel Barrow")
        << tr("Aquarium Garden");

    directionList
        << tr("Right")
        << tr("Left");

    colorList
        << tr("Original")
        << tr("Imitater")
        << tr("White")
        << tr("Magenta")
        << tr("Orange")
        << tr("Pink")
        << tr("Cyan")
        << tr("Red")
        << tr("Blue")
        << tr("Purple")
        << tr("Lavender")
        << tr("Yellow")
        << tr("LightGreen");

    plantStatusList
        << tr("Sprout")
        << tr("Small Size")
        << tr("Medium Size")
        << tr("Full Size");

    vaseHeadersList
        << tr("Index")
        << tr("Row")
        << tr("Column")
        << tr("Skin")
        << tr("Type")
        << tr("Content");

    vaseSkinList
        << tr("None")
        << tr("Unknown")
        << tr("Plant")
        << tr("Zombie");

    vaseTypeList
        << tr("Empty")
        << tr("Plant")
        << tr("Zombie")
        << tr("Sun");

    debugModeList
        << tr("Off")
        << tr("Spawning")
        << tr("Music")
        << tr("Memory")
        << tr("Collision");

    endlessBuildNameList
        << "[PE].二十四炮"
        << "[FE].智能无炮"
        << "[DE].双冰无炮"
        << "[FE].两仪无炮"
        << "[ME].双核无炮"
        << "[PE].石英钟·改"
        << "[PE].核武二炮"
        << "[PE].火焰二炮"
        << "[PE].方正二炮"
        << "[PE].分裂二炮"
        << "[PE].王子无炮"
        << "[PE].冲关三炮"
        << "[PE].3C八炮"
        << "[PE].经典十六炮"
        << "[FE].神之四炮"
        << "[PE].经典四炮"
        << "[RE].#四炮"
        << "[DE].后置四炮"
        << "[NE].雪花七炮"
        << "[PE].心五炮"
        << "[ME].神之六炮"
        << "[DE].花园六炮"
        << "[PE].神之六炮"
        << "[PE].方六炮"
        << "[ME].底置六炮"
        << "[DE].后置六炮"
        << "[NE].变奏一炮"
        << "[PE].压制一炮"
        << "[FE].后退无炮"
        << "[PE].散炸五炮"
        << "[PE].后置八炮"
        << "[PE].经典八炮"
        << "[RE].#八炮"
        << "[DE].前置八炮"
        << "[NE].土豆四炮"
        << "[PE].轮炸九炮"
        << "[FE].磁铁四炮"
        << "[DE].神之八炮"
        << "[NE].核代十炮"
        << "[PE].经典十炮"
        << "[ME].月夜十炮"
        << "[PE].后置十炮"
        << "[PE].C2八炮"
        << "[PE].双冰十六炮"
        << "[PE].神棍十四炮"
        << "[DE].双冰六炮"
        << "[NE].十五炮"
        << "[PE].火焰十二炮"
        << "[ME].十三炮"
        << "[DE].十四炮"
        << "[NE].二十炮"
        << "[PE].垫材二十四炮"
        << "[RE].二十炮"
        << "[PE].新二十二炮"
        << "[PE].饲养海豚"
        << "[NE].压碑五炮"
        << "[NE].减速无炮"
        << "[PE].神之无炮"
        << "[RE].群曾无炮"
        << "[FE].无神无炮"
        << "[NE].生死劫"
        << "[PE].真·二炮"
        << "[RE].理发八炮"
        << "[FE].全明星八炮"
        << "[NE].智商五炮"
        << "[PE].后置八炮靠天开局"
        << "[PE].十字十二炮挂机"
        << "[PE].穿越十四炮"
        << "[PE].纯四炮"
        << "[FE].落月四炮"
        << "[RE].水晶杯四炮"
        << "[PE].太极四炮"
        << "[PE].冰心灯"
        << "[FE].心无炮"
        << "[RE].波纹五炮"
        << "[DE].沙漏十一炮"
        << "[PE].半场无植物五炮"
        << "[PE].陆地无植物六炮"
        << "[PE].水路无植物六炮"
        << "[PE].间隔无植物七炮"
        << "[NE].瞬杀七炮"
        << "[PE].分离八炮"
        << "[PE].尾炸十八炮"
        << "[DE].镂空四炮"
        << "[PE].无保护八炮"
        << "[FE].无保护八炮"
        << "[RE].神之十炮"
        << "[DE].无保护六炮"
        << "[NE].舞夜惊魂"
        << "[PE].六线囚尸"
        << "[PE].绝望之路"
        << "[DE].孔明无炮"
        << "[PE].二十炮挂机"
        << "[PE].十炮挂机"
        << "[RE].十炮挂机"
        << "[DE].十二炮挂机"
        << "[PE].全金属四炮"
        << "[PE].冰雨十二炮开局"
        << "[PE].纯白悬空十二炮开局"
        << "[PE].钉耙二十炮开局"
        << "[PE].半场十二炮"
        << "[FE].弦十四炮"
        << "[RE].椭盘十四炮"
        << "[PE].对称十六炮"
        << "[DE].二十炮"
        << "[FE].Ice3·二十四炮"
        << "[ME].二十炮"
        << "[PE].纯二十炮"
        << "[PE].神之十六炮"
        << "[NE].火焰无炮"
        << "[NE].神之无炮"
        << "[FE].无冰瓜一炮"
        << "[PE].经典二炮"
        << "[PE].浮萍八炮"
        << "[PE].传统四炮"
        << "[NE].倾斜四炮"
        << "[FE].雾四炮"
        << "[NE].小二炮"
        << "[FE].花环十六炮"
        << "[PE].一勺汤圆"
        << "[NE].快六炮"
        << "[ME].无蘑菇七炮"
        << "[DE].樱桃七炮"
        << "[PE].神之八炮挂机"
        << "[FE].烈焰八炮"
        << "[PE].⑨炮"
        << "[RE].方块八炮"
        << "[PE].简化十炮"
        << "[PE].梯曾十二炮"
        << "[PE].底线四炮"
        << "[NE].神之五炮"
        << "[PE].火焰十六炮"
        << "[RE].十六炮"
        << "[PE].新二十炮"
        << "[PE].九列二十二炮"
        << "[PE].石英钟无炮"
        << "[PE].经典十二炮"
        << "[PE].灰烬十八炮"
        << "[PE].无神闯关"
        << "[PE].全对称八炮"
        << "[PE].水路无植物十二炮"
        << "[PE].单卡十二炮开局"
        << "[DE].守钉耙十一炮"
        << "[DE].十五炮"
        << "[DE].十八炮"
        << "[FE].经典八炮"
        << "[DE].超前置八炮"
        << "[DE].神之十一炮"
        << "[PE].神柱十二炮"
        << "[PE].玉米八炮"
        << "[PE].二十二炮"
        << "[PE].裸奔十六炮"
        << "[DE].十六炮"
        << "[PE].神之四炮"
        << "[NE].守钉耙十三炮"
        << "[PE].神之十五炮"
        << "[PE].水路无植物四炮"
        << "[PE].超前置无炮"
        << "[PE].无冰瓜二十二炮"
        << "[DE].简化八炮"
        << "[ME].奇怪的八炮"
        << "[PE].魔方十炮"
        << "[RE].方三角六炮"
        << "[RE].斜方八炮"
        << "[PE].太极十四炮"
        << "[FE].礼物盒十四炮"
        << "[PE].六芒星十炮"
        << "[PE].树八炮"
        << "[PE].全对称树八炮"
        << "[DE].雪花十四炮"
        << "[PE].心九炮";

    endlessBuildStringList
        << "0,2F 1 1 0 0 0,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2F 2 3 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,29 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,E 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,2F 6 1 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "1,2A 1 1 1 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 0,A 1 5 1 0 0,29 2 1 0 0 0,1E 2 1 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,A 2 4 1 0 0,1E 2 4 0 0 0,A 2 5 1 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,10 3 3 0 0 0,29 3 3 0 0 0,10 3 4 0 0 0,2A 3 4 1 0 0,1E 3 4 0 0 0,10 3 5 0 0 0,2A 3 5 1 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,2A 4 4 1 0 0,1E 4 4 0 0 0,10 4 5 0 0 0,2A 4 5 1 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,2A 5 1 1 0 0,1E 5 1 0 0 0,25 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 0,A 5 5 1 0 0,2C 6 1 0 0 0,1E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 0,A 6 5 1 0 0"
        << "2,29 1 1 0 0 0,1E 1 1 0 0 0,29 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 0,2A 2 5 1 0 0,1E 2 5 0 0 0,2A 2 6 1 0 0,29 3 1 0 0 0,1E 3 1 0 0 0,29 3 2 0 0 0,1E 3 2 0 0 0,E 3 3 0 0 0,1E 3 3 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 0,2C 3 5 0 0 0,1E 3 5 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,25 4 1 0 0 0,1E 4 1 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,2C 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 0,2A 4 5 1 0 0,1E 4 5 0 0 0,2A 4 6 1 0 0,29 5 1 0 0 0,1E 5 1 0 0 0,29 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 0"
        << "1,29 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,25 3 2 0 0 0,10 3 3 0 0 0,29 3 3 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,25 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,29 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 0"
        << "5,21 1 1 0 0 0,2C 1 1 0 0 0,1E 1 1 0 0 0,21 1 2 0 0 0,29 1 2 0 0 0,1E 1 2 0 0 0,21 1 3 0 0 0,A 1 3 1 0 0,1E 1 3 0 0 0,21 1 4 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 0,21 2 1 0 0 0,29 2 1 0 0 0,1E 2 1 0 0 0,21 2 2 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 0,21 2 3 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 0,21 2 4 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 0,21 2 5 0 0 0,2A 2 5 1 0 0,1E 2 5 0 0 0,21 3 1 0 0 0,29 3 1 0 0 0,1E 3 1 0 0 0,21 3 2 0 0 0,29 3 2 0 0 0,1E 3 2 0 0 0,21 3 3 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 0,21 3 4 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 0,21 3 5 0 0 0,1E 3 5 0 0 0,21 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,21 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,21 4 1 0 0 0,29 4 1 0 0 0,1E 4 1 0 0 0,21 4 2 0 0 0,25 4 2 0 0 0,1E 4 2 0 0 0,21 4 3 0 0 0,2C 4 3 0 0 0,1E 4 3 0 0 0,21 4 4 0 0 0,2A 4 4 1 0 0,1E 4 4 0 0 0,21 4 5 0 0 0,2A 4 5 1 0 0,1E 4 5 0 0 0,21 5 1 0 0 0,2C 5 1 0 0 0,1E 5 1 0 0 0,21 5 2 0 0 0,29 5 2 0 0 0,1E 5 2 0 0 0,21 5 3 0 0 0,A 5 3 1 0 0,1E 5 3 0 0 0,21 5 4 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 0"
        << "0,2C 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 0,A 1 5 1 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 0,E 2 3 0 0 0,1E 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 0,2A 2 5 1 0 0,1E 2 5 0 0 0,2A 2 6 1 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,E 3 2 0 0 0,10 3 3 0 0 0,E 3 3 0 0 0,10 3 4 0 0 0,E 3 4 0 0 0,10 3 5 0 0 0,29 3 5 0 0 0,1E 3 5 0 0 0,2B 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 3 8 0 0 0,2A 3 8 1 0 0,1E 3 8 0 0 0,10 3 9 0 0 0,2A 3 9 1 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,E 4 3 0 0 0,2B 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,29 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,10 4 8 0 0 0,2A 4 8 1 0 0,1E 4 8 0 0 0,10 4 9 0 0 0,2A 4 9 1 0 0,1E 4 9 0 0 0,2A 5 1 1 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 0,A 5 5 1 0 0,1E 5 5 0 0 0,2A 5 6 1 0 0,25 6 1 0 0 0,1E 6 1 0 0 0,2C 6 2 0 0 0,1E 6 2 0 0 0,A 6 3 1 0 0,1E 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 0,A 6 5 1 0 0"
        << "0,29 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 0,29 1 3 0 0 0,1E 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 0,A 1 5 1 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 0,2A 2 5 1 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2C 3 3 0 0 0,10 3 4 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 0,10 3 5 0 0 0,E 3 5 0 0 0,1E 3 5 0 0 0,10 3 7 0 0 0,F 3 7 0 0 1,10 3 8 0 0 0,F 3 8 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,2B 4 3 0 0 0,10 4 4 0 0 0,29 4 4 0 0 0,1E 4 4 0 0 0,10 4 5 0 0 0,2A 4 5 1 0 0,1E 4 5 0 0 0,10 4 7 0 0 0,F 4 7 0 0 0,10 4 8 0 0 0,F 4 8 0 0 1,25 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 0,2A 5 5 1 0 0,29 6 1 0 0 0,1E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 0,29 6 3 0 0 0,1E 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 0,A 6 5 1 0 0"
        << "0,28 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,28 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,28 1 4 0 0 0,1E 1 4 0 0 0,16 1 5 0 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,28 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,28 2 4 0 0 0,1E 2 4 0 0 0,16 2 5 0 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,2F 3 2 0 0 0,10 3 3 0 0 0,10 3 4 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 0,10 3 5 0 0 0,E 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,2F 4 2 0 0 0,10 4 3 0 0 0,10 4 4 0 0 0,29 4 4 0 0 0,1E 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,25 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,28 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,28 5 4 0 0 0,1E 5 4 0 0 0,16 5 5 0 0 0,28 6 1 0 0 0,1E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,28 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,28 6 4 0 0 0,1E 6 4 0 0 0,16 6 5 0 0 0"
        << "0,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 0,2C 1 5 0 0 0,1E 1 5 0 0 0,E 1 6 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 0,2A 2 6 1 0 0,10 3 1 0 0 0,25 3 1 0 0 0,10 3 2 0 0 0,2A 3 2 1 0 0,10 3 3 0 0 0,29 3 3 0 0 0,10 3 4 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 0,10 3 5 0 0 0,29 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,2B 4 1 0 0 0,10 4 2 0 0 0,2A 4 2 1 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,25 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,29 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,A 5 5 1 0 0,1E 5 5 0 0 0,2A 5 6 1 0 0,28 6 1 0 0 0,1E 6 1 0 0 0,28 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,28 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,16 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,A 6 5 1 0 0,1E 6 5 0 0 0,E 6 6 0 0 0"
        << "0,25 1 1 0 0 0,1E 1 1 0 0 0,2C 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2F 1 4 0 0 0,2A 2 1 1 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2F 2 4 0 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,2B 3 3 0 0 0,1E 3 3 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,E 4 3 0 0 0,10 4 4 0 0 0,E 4 4 0 0 0,2B 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2C 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,10 4 8 0 0 0,2A 4 8 1 0 0,1E 4 8 0 0 0,10 4 9 0 0 0,2A 4 9 1 0 0,1E 4 9 0 0 0,2A 5 1 1 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 0,A 5 5 1 0 0,1E 5 5 0 0 0,2A 5 6 1 0 0,25 6 1 0 0 0,1E 6 1 0 0 0,2C 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,A 6 3 1 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,A 6 5 1 0 0"
        << "0,28 1 1 0 0 0,1E 1 1 0 0 0,28 1 2 0 0 0,1E 1 2 0 0 0,28 1 3 0 0 0,1E 1 3 0 0 0,28 1 4 0 0 0,1E 1 4 0 0 0,16 1 5 0 0 0,1E 1 5 0 0 0,2E 1 6 0 0 0,2E 1 7 0 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 0,E 2 3 0 0 0,1E 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 0,E 2 5 0 0 0,1E 2 5 0 0 0,E 2 6 0 0 0,1E 2 6 0 0 0,E 2 7 0 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,2A 3 2 1 0 0,10 3 3 0 0 0,29 3 3 0 0 0,2B 3 4 0 0 0,10 3 5 0 0 0,2C 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,E 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 3 8 0 0 0,2A 3 8 1 0 0,1E 3 8 0 0 0,10 3 9 0 0 0,2A 3 9 1 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,2B 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,29 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,10 4 8 0 0 0,2A 4 8 1 0 0,1E 4 8 0 0 0,10 4 9 0 0 0,2A 4 9 1 0 0,1E 4 9 0 0 0,25 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 0,E 5 3 0 0 0,1E 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 0,2C 5 5 0 0 0,1E 5 5 0 0 0,2A 5 6 1 0 0,1E 5 6 0 0 0,2C 6 1 0 0 0,1E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 0,A 6 5 1 0 0,A 6 6 1 0 0"
        << "0,28 1 1 0 0 0,1E 1 1 0 0 0,28 1 2 0 0 0,1E 1 2 0 0 0,28 1 3 0 0 0,1E 1 3 0 0 0,16 1 4 0 0 0,1E 1 4 0 0 0,1C 1 5 0 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 0,E 2 3 0 0 0,1E 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 0,2A 2 5 1 0 0,1E 2 5 0 0 0,2A 2 6 1 0 0,1E 2 6 0 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,2A 3 2 1 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,2B 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,29 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 3 8 0 0 0,2A 3 8 1 0 0,1E 3 8 0 0 0,10 3 9 0 0 0,2A 3 9 1 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,2B 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,29 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,10 4 8 0 0 0,2A 4 8 1 0 0,1E 4 8 0 0 0,10 4 9 0 0 0,2A 4 9 1 0 0,1E 4 9 0 0 0,25 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 0,E 5 3 0 0 0,1E 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 0,2A 5 5 1 0 0,1E 5 5 0 0 0,2A 5 6 1 0 0,1E 5 6 0 0 0,2C 6 1 0 0 0,1E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 0,A 6 3 1 0 0,1E 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 0,2E 6 5 0 0 0"
        << "0,2C 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 0,2F 1 5 0 0 0,2E 1 7 0 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 0,25 2 4 0 0 0,1E 2 4 0 0 0,2F 2 5 0 0 0,2E 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,29 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,29 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 3 8 0 0 0,2A 3 8 1 0 0,1E 3 8 0 0 0,10 3 9 0 0 0,2A 3 9 1 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,29 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,10 4 8 0 0 0,2A 4 8 1 0 0,1E 4 8 0 0 0,10 4 9 0 0 0,2A 4 9 1 0 0,1E 4 9 0 0 0,25 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 0,25 5 4 0 0 0,1E 5 4 0 0 0,2F 5 5 0 0 0,2E 5 7 0 0 0,2C 6 1 0 0 0,1E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 0,2F 6 5 0 0 0,2E 6 7 0 0 0"
        << "0,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2A 1 4 1 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2A 5 4 1 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 6 1 0 0 0,2A 6 3 1 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2A 6 4 1 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0"
        << "1,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,29 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,29 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0"
        << "0,29 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,E 1 4 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2A 2 5 1 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,E 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2A 5 5 1 0 0,29 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,E 6 4 0 0 0"
        << "4,21 1 1 0 0 0,29 1 1 0 0 0,1E 1 1 0 0 0,21 1 2 0 0 0,2C 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,21 1 3 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,21 1 4 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,21 1 5 0 0 0,A 1 5 1 0 0,1E 1 5 0 0 0,21 2 1 0 0 0,25 2 1 0 0 0,21 2 2 0 0 0,2F 2 2 0 0 0,21 2 3 0 0 0,21 2 4 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,21 2 5 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,21 2 6 0 0 0,2A 2 6 1 0 0,1E 2 6 0 0 0,21 2 7 0 0 0,2A 2 7 1 0 0,21 3 1 0 0 0,E 3 1 0 0 0,21 3 2 0 0 0,2F 3 2 0 0 0,21 3 3 0 0 0,21 3 4 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,21 3 5 0 0 0,25 3 5 0 0 0,1E 3 5 0 0 1,30 3 5 0 0 0,21 3 6 0 0 0,2F 3 6 0 0 0,21 3 7 0 0 0,21 3 8 0 0 0,25 3 8 0 0 0,21 4 1 0 0 0,25 4 1 0 0 0,21 4 2 0 0 0,2F 4 2 0 0 0,21 4 3 0 0 0,21 4 4 0 0 0,2A 4 4 1 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,21 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 1,30 4 5 0 0 0,21 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,21 4 7 0 0 0,2A 4 7 1 0 0,21 5 1 0 0 0,29 5 1 0 0 0,1E 5 1 0 0 0,21 5 2 0 0 0,2C 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,21 5 3 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,21 5 4 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,21 5 5 0 0 0,A 5 5 1 0 0,1E 5 5 0 0 0"
        << "2,E 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2F 1 4 0 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,29 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,2A 2 5 1 0 0,2F 3 1 0 0 0,1C 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,2F 3 4 0 0 0,2A 4 1 1 0 0,1E 4 1 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,29 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2C 4 4 0 0 0,2A 4 5 1 0 0,E 5 1 0 0 0,1E 5 1 0 0 0,25 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2F 5 4 0 0 0"
        << "3,29 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,2F 2 6 0 0 0,2F 3 1 0 0 0,2A 3 3 1 0 0,1E 3 3 0 0 0,25 3 4 0 0 0,1E 3 4 0 0 0,2F 3 5 0 0 0,2F 3 7 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,25 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,29 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 1,30 4 5 0 0 0,2F 4 6 0 0 0,29 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0"
        << "0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,25 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,29 1 5 0 0 0,1E 1 5 0 0 0,29 1 6 0 0 0,1E 1 6 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2A 2 7 1 0 0,1E 2 7 0 0 0,10 3 1 0 0 0,E 3 1 0 0 0,10 3 2 0 0 0,2F 3 2 0 0 0,10 3 3 0 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 6 0 0 0,29 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 2 0 0 0,2A 4 2 1 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,2B 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2A 5 5 1 0 0,1E 5 5 0 0 0,2E 6 1 0 0 0,2E 6 2 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 1,30 6 4 0 0 0"
        << "5,21 2 1 0 0 0,2F 2 1 0 0 0,21 2 2 0 0 0,21 2 3 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,21 2 4 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,21 2 5 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,21 2 6 0 0 0,2F 2 6 0 0 0,21 2 7 0 0 0,21 3 1 0 0 0,2F 3 1 0 0 0,21 3 2 0 0 0,21 3 3 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,21 3 4 0 0 0,25 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,21 3 5 0 0 0,29 3 5 0 0 0,1E 3 5 0 0 1,30 3 5 0 0 0,21 3 6 0 0 0,2F 3 6 0 0 0,21 3 7 0 0 0,21 4 1 0 0 0,2F 4 1 0 0 0,21 4 2 0 0 0,21 4 3 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,21 4 4 0 0 0,29 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,21 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 1,30 4 5 0 0 0,21 4 6 0 0 0,2F 4 6 0 0 0,21 4 7 0 0 0"
        << "2,E 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,29 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2A 1 5 1 0 0,1E 1 5 0 0 1,30 1 5 0 0 0,E 1 6 0 0 0,1E 1 6 0 0 0,2A 2 1 1 0 0,1E 2 1 0 0 0,2F 2 2 0 0 0,2F 2 4 0 0 0,2A 2 6 1 0 0,1E 2 6 0 0 0,29 3 1 0 0 0,1E 3 1 0 0 0,2F 3 2 0 0 0,2F 3 4 0 0 0,29 3 6 0 0 0,1E 3 6 0 0 0,2A 4 1 1 0 0,1E 4 1 0 0 0,2F 4 2 0 0 0,2F 4 4 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,E 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,29 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2A 5 5 1 0 0,1E 5 5 0 0 1,30 5 5 0 0 0,E 5 6 0 0 0,1E 5 6 0 0 0"
        << "0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2A 2 5 1 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2A 5 5 1 0 0,1E 5 5 0 0 1,30 5 5 0 0 0"
        << "0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2F 1 4 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,A 2 5 1 0 0,2A 2 6 1 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2C 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,25 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,25 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,A 5 5 1 0 0,2A 5 6 1 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2F 6 4 0 0 0"
        << "5,21 1 1 0 0 0,2F 1 1 0 0 0,21 1 2 0 0 0,21 1 3 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,21 1 4 0 0 0,25 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,21 1 5 0 0 0,2C 1 5 0 0 0,1E 1 5 0 0 1,30 1 5 0 0 0,21 2 1 0 0 0,25 2 1 0 0 0,21 2 2 0 0 0,2F 2 2 0 0 0,21 2 3 0 0 0,21 2 4 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,21 2 5 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,21 2 6 0 0 0,2A 2 6 1 0 0,21 3 1 0 0 0,29 3 1 0 0 0,21 3 2 0 0 0,2F 3 2 0 0 0,21 3 3 0 0 0,21 3 4 0 0 0,2A 3 4 1 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,21 3 5 0 0 0,25 3 5 0 0 0,1E 3 5 0 0 1,30 3 5 0 0 0,21 3 6 0 0 0,2F 3 6 0 0 0,21 4 1 0 0 0,25 4 1 0 0 0,21 4 2 0 0 0,2F 4 2 0 0 0,21 4 3 0 0 0,21 4 4 0 0 0,29 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,21 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 1,30 4 5 0 0 0,21 4 6 0 0 0,2A 4 6 1 0 0,21 5 1 0 0 0,2F 5 1 0 0 0,21 5 2 0 0 0,21 5 3 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,21 5 4 0 0 0,25 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,21 5 5 0 0 0,2C 5 5 0 0 0,1E 5 5 0 0 1,30 5 5 0 0 0"
        << "2,E 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2F 1 4 0 0 0,2A 2 1 1 0 0,1E 2 1 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2F 2 4 0 0 0,2F 3 1 0 0 0,1C 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,2F 3 4 0 0 0,2A 4 1 1 0 0,1E 4 1 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,2C 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2F 4 4 0 0 0,29 5 1 0 0 0,1E 5 1 0 0 0,25 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2F 5 4 0 0 0"
        << "3,29 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 0,A 1 5 1 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,29 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 0,2A 2 5 1 0 0,1E 2 5 0 0 0,2A 2 6 1 0 0,2F 3 1 0 0 0,1C 3 3 0 0 0,1E 3 3 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 0,1E 3 5 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,2A 4 1 1 0 0,1E 4 1 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,29 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,29 4 4 0 0 0,1E 4 4 0 0 0,2A 4 5 1 0 0,1E 4 5 0 0 0,2A 4 6 1 0 0,29 5 1 0 0 0,1E 5 1 0 0 0,25 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 0,A 5 5 1 0 0"
        << "0,25 1 1 0 0 0,1E 1 1 0 0 0,2C 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 0,2A 2 1 1 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2A 2 5 1 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,29 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,E 4 3 0 0 0,2B 4 4 0 0 0,10 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,2A 5 1 1 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2A 5 5 1 0 0,25 6 1 0 0 0,1E 6 1 0 0 0,2C 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,A 6 3 1 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 0"
        << "1,2C 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 0,A 2 4 1 0 0,1E 2 4 0 0 0,2A 2 5 1 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,10 3 3 0 0 0,29 3 3 0 0 0,10 3 4 0 0 0,29 3 4 0 0 0,10 3 5 0 0 0,19 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,2B 4 4 0 0 0,10 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,25 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 0,2A 5 5 1 0 0,2C 6 1 0 0 0,1E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,A 6 3 1 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 0"
        << "0,28 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,28 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,28 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,16 1 5 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 0,2A 2 5 1 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2C 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,2B 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,25 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,E 4 7 0 0 0,1E 4 7 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,29 5 5 0 0 0,2A 5 6 1 0 0,29 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,29 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0"
        << "0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2F 1 4 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2F 2 4 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,25 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,25 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2F 5 4 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2F 6 4 0 0 0"
        << "0,2C 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2C 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,25 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,29 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2C 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0"
        << "4,21 1 1 0 0 0,2F 1 1 0 0 0,21 1 2 0 0 0,21 1 3 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,21 1 4 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,21 1 5 0 0 0,2C 1 5 0 0 0,1E 1 5 0 0 1,30 1 5 0 0 0,21 1 6 0 0 0,2F 1 6 0 0 0,21 1 7 0 0 0,21 2 1 0 0 0,25 2 1 0 0 0,21 2 2 0 0 0,2F 2 2 0 0 0,21 2 3 0 0 0,21 2 4 0 0 0,25 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,21 2 5 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,21 2 6 0 0 0,25 2 6 0 0 0,1E 2 6 0 0 0,21 2 7 0 0 0,2A 2 7 1 0 0,21 3 1 0 0 0,E 3 1 0 0 0,21 3 2 0 0 0,2F 3 2 0 0 0,21 3 3 0 0 0,21 3 4 0 0 0,2A 3 4 1 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,21 3 5 0 0 0,2C 3 5 0 0 0,1E 3 5 0 0 1,30 3 5 0 0 0,21 3 6 0 0 0,2F 3 6 0 0 0,21 3 7 0 0 0,21 4 1 0 0 0,25 4 1 0 0 0,21 4 2 0 0 0,2F 4 2 0 0 0,21 4 3 0 0 0,21 4 4 0 0 0,25 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,21 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 1,30 4 5 0 0 0,21 4 6 0 0 0,25 4 6 0 0 0,1E 4 6 0 0 0,21 4 7 0 0 0,2A 4 7 1 0 0,21 5 1 0 0 0,2F 5 1 0 0 0,21 5 2 0 0 0,21 5 3 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,21 5 4 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,21 5 5 0 0 0,2C 5 5 0 0 0,1E 5 5 0 0 1,30 5 5 0 0 0,21 5 6 0 0 0,2F 5 6 0 0 0,21 5 7 0 0 0"
        << "2,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 3 1 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,E 4 1 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,25 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0"
        << "3,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,29 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 3 1 0 0 0,4 3 3 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,2A 3 7 1 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,29 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,29 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0"
        << "0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2F 1 4 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2F 2 4 0 0 0,10 3 1 0 0 0,2C 3 1 0 0 0,10 3 2 0 0 0,2F 3 2 0 0 0,10 3 3 0 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,25 3 7 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,10 4 8 0 0 0,2A 4 8 1 0 0,1E 4 8 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,28 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,28 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,16 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0"
        << "1,2F 1 1 0 0 0,1F 1 3 1 0 0,1E 1 3 0 0 0,1F 1 4 1 0 0,1E 1 4 0 0 0,2C 1 5 0 0 0,1E 1 5 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 0,10 3 1 0 0 0,1F 3 1 1 0 0,10 3 2 0 0 0,1F 3 2 1 0 0,10 3 3 0 0 0,1F 3 3 1 0 0,10 3 4 0 0 0,1F 3 4 1 0 0,10 3 5 0 0 0,29 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,29 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 1 0 0 0,1F 4 1 1 0 0,10 4 2 0 0 0,1F 4 2 1 0 0,10 4 3 0 0 0,1F 4 3 1 0 0,10 4 4 0 0 0,1F 4 4 1 0 0,10 4 5 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,29 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 0,2A 5 4 1 0 0,1E 5 4 0 0 0,2C 5 5 0 0 0,1E 5 5 0 0 0,2F 6 1 0 0 0,1F 6 3 1 0 0,1E 6 3 0 0 0,1F 6 4 1 0 0,1E 6 4 0 0 0,2C 6 5 0 0 0,1E 6 5 0 0 0"
        << "2,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,2F 3 1 0 0 0,25 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,E 3 7 0 0 1,E 3 8 0 0 0,2F 4 1 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,29 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0,2F 4 7 0 0 0"
        << "3,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2A 1 4 1 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 3 1 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,2F 4 1 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2A 4 4 1 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2A 5 4 1 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0"
        << "0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2C 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,17 3 7 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,17 4 7 0 0 0,2C 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0"
        << "5,21 1 1 0 0 0,2F 1 1 0 0 0,21 1 2 0 0 0,21 1 3 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,21 1 4 0 0 0,25 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,21 1 5 0 0 0,2C 1 5 0 0 0,1E 1 5 0 0 1,30 1 5 0 0 0,21 1 6 0 0 0,2F 1 6 0 0 0,21 1 7 0 0 0,21 2 1 0 0 0,2F 2 1 0 0 0,21 2 2 0 0 0,21 2 3 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,21 2 4 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,21 2 5 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,21 2 6 0 0 0,2F 2 6 0 0 0,21 2 7 0 0 0,21 3 1 0 0 0,2F 3 1 0 0 0,21 3 2 0 0 0,21 3 3 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,21 3 4 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,21 3 5 0 0 0,2C 3 5 0 0 0,1E 3 5 0 0 1,30 3 5 0 0 0,21 3 6 0 0 0,2F 3 6 0 0 0,21 3 7 0 0 0,21 4 1 0 0 0,2F 4 1 0 0 0,21 4 2 0 0 0,21 4 3 0 0 0,2C 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,21 4 4 0 0 0,25 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,21 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 1,30 4 5 0 0 0,21 4 6 0 0 0,2F 4 6 0 0 0,21 4 7 0 0 0,21 5 1 0 0 0,2F 5 1 0 0 0,21 5 2 0 0 0,21 5 3 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,21 5 4 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,21 5 5 0 0 0,2C 5 5 0 0 0,1E 5 5 0 0 1,30 5 5 0 0 0,21 5 6 0 0 0,2F 5 6 0 0 0,21 5 7 0 0 0"
        << "0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2F 1 4 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2F 2 4 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,25 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2F 5 4 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2F 6 4 0 0 0"
        << "0,2A 1 1 1 0 0,1E 1 1 0 0 0,2F 1 2 0 0 0,2F 1 4 0 0 0,2A 2 1 1 0 0,1E 2 1 0 0 0,25 2 2 0 0 0,2F 2 3 0 0 0,2A 2 5 1 0 0,10 3 1 0 0 0,E 3 1 0 0 1,10 3 2 0 0 0,29 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,29 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 4 1 0 0 0,E 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,2A 5 1 1 0 0,1E 5 1 0 0 0,25 5 2 0 0 0,2F 5 3 0 0 0,2A 5 5 1 0 0,2A 6 1 1 0 0,1E 6 1 0 0 0,2F 6 2 0 0 0,2F 6 4 0 0 0"
        << "0,2F 1 5 0 0 0,2F 1 7 0 0 0,E 2 1 0 0 1,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "0,29 1 1 0 0 0,1E 1 1 0 0 0,2F 1 2 0 0 0,2F 1 4 0 0 0,2A 2 1 1 0 0,1E 2 1 0 0 0,2F 2 2 0 0 0,2F 2 4 0 0 0,E 2 6 0 0 1,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,2A 5 1 1 0 0,1E 5 1 0 0 0,2F 5 2 0 0 0,2F 5 4 0 0 0,E 5 6 0 0 0,29 6 1 0 0 0,1E 6 1 0 0 0,2F 6 2 0 0 0,2F 6 4 0 0 0"
        << "2,E 1 1 0 0 1,1E 1 1 0 0 0,25 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,29 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2A 2 1 1 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 3 1 0 0 0,16 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,1C 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,25 4 1 0 0 0,1E 4 1 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,29 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0,E 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0"
        << "3,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2A 1 4 1 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 0,1E 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,2F 3 1 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,2F 3 7 0 0 0,2F 4 1 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2A 4 4 1 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0,2F 4 7 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0"
        << "0,28 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,28 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,16 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,28 2 1 0 0 0,1E 2 1 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,28 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,16 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,28 5 1 0 0 0,1E 5 1 0 0 0,25 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,28 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,16 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,28 6 1 0 0 0,1E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,28 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,16 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0"
        << "5,21 1 1 0 0 0,2F 1 1 0 0 0,21 1 2 0 0 0,21 1 3 0 0 0,2F 1 3 0 0 0,21 1 4 0 0 0,21 1 5 0 0 0,2F 1 5 0 0 0,21 1 6 0 0 0,21 2 1 0 0 0,2F 2 1 0 0 0,21 2 2 0 0 0,21 2 3 0 0 0,2F 2 3 0 0 0,21 2 4 0 0 0,21 2 5 0 0 0,2F 2 5 0 0 0,21 2 6 0 0 0,21 3 1 0 0 0,2F 3 1 0 0 0,21 3 2 0 0 0,21 3 3 0 0 0,2F 3 3 0 0 0,21 3 4 0 0 0,21 3 5 0 0 0,2F 3 5 0 0 0,21 3 6 0 0 0,21 4 1 0 0 0,2F 4 1 0 0 0,21 4 2 0 0 0,21 4 3 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,21 4 4 0 0 0,25 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,21 4 5 0 0 0,2A 4 5 1 0 0,1E 4 5 0 0 1,30 4 5 0 0 0,21 4 6 0 0 0,2F 4 6 0 0 0,21 4 7 0 0 0,21 5 1 0 0 0,2F 5 1 0 0 0,21 5 2 0 0 0,21 5 3 0 0 0,29 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,21 5 4 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,21 5 5 0 0 0,2C 5 5 0 0 0,1E 5 5 0 0 1,30 5 5 0 0 0,21 5 6 0 0 0,2F 5 6 0 0 0,21 5 7 0 0 0"
        << "2,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,2F 3 1 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,E 3 5 0 0 0,2F 3 6 0 0 0,2F 4 1 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0,2F 4 7 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0"
        << "3,2F 1 1 0 0 0,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2F 2 3 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,2F 3 1 0 0 0,2F 3 3 0 0 0,2F 3 5 0 0 0,2F 3 7 0 0 0,2F 4 1 0 0 0,2F 4 3 0 0 0,2F 4 5 0 0 0,2F 4 7 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0"
        << "0,2F 1 1 0 0 0,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2F 2 3 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,29 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,29 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,2F 6 1 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "4,21 1 1 0 0 0,2F 1 1 0 0 0,21 1 2 0 0 0,21 1 3 0 0 0,2F 1 3 0 0 0,21 1 4 0 0 0,21 1 5 0 0 0,2F 1 5 0 0 0,21 1 6 0 0 0,21 1 7 0 0 0,2F 1 7 0 0 0,21 1 8 0 0 0,21 2 1 0 0 0,2F 2 1 0 0 0,21 2 2 0 0 0,21 2 3 0 0 0,2F 2 3 0 0 0,21 2 4 0 0 0,21 2 5 0 0 0,2F 2 5 0 0 0,21 2 6 0 0 0,21 2 7 0 0 0,2F 2 7 0 0 0,21 2 8 0 0 0,21 2 9 0 0 0,E 2 9 0 0 0,21 3 1 0 0 0,2F 3 1 0 0 0,21 3 2 0 0 0,21 3 3 0 0 0,2F 3 3 0 0 0,21 3 4 0 0 0,21 3 5 0 0 0,2F 3 5 0 0 0,21 3 6 0 0 0,21 3 7 0 0 0,2F 3 7 0 0 0,21 3 8 0 0 0,21 3 9 0 0 0,E 3 9 0 0 0,21 4 1 0 0 0,2F 4 1 0 0 0,21 4 2 0 0 0,21 4 3 0 0 0,2F 4 3 0 0 0,21 4 4 0 0 0,21 4 5 0 0 0,2F 4 5 0 0 0,21 4 6 0 0 0,21 4 7 0 0 0,2F 4 7 0 0 0,21 4 8 0 0 0,21 4 9 0 0 0,E 4 9 0 0 0,21 5 1 0 0 0,2F 5 1 0 0 0,21 5 2 0 0 0,21 5 3 0 0 0,2F 5 3 0 0 0,21 5 4 0 0 0,21 5 5 0 0 0,2F 5 5 0 0 0,21 5 6 0 0 0,21 5 7 0 0 0,2F 5 7 0 0 0,21 5 8 0 0 0"
        << "0,2F 1 1 0 0 0,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2F 2 3 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,29 3 7 0 0 0,10 3 8 0 0 0,29 3 8 0 0 0,10 3 9 0 0 0,E 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,29 4 7 0 0 0,10 4 8 0 0 0,29 4 8 0 0 0,10 4 9 0 0 0,E 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,2F 6 1 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,29 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,29 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,25 3 1 0 0 0,1E 3 1 0 0 0,10 3 2 0 0 0,2F 3 2 0 0 0,10 3 3 0 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 6 0 0 0,25 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,25 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2F 5 4 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2F 6 4 0 0 0"
        << "3,29 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,21 1 5 0 0 1,2F 1 5 0 0 0,32 1 6 0 0 0,32 1 7 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,21 2 5 0 0 1,2F 2 5 0 0 0,32 2 6 0 0 0,32 2 7 0 0 0,29 3 2 0 0 0,1E 3 2 0 0 1,30 3 2 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,21 3 5 0 0 1,2F 3 5 0 0 0,32 3 6 0 0 0,32 3 7 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,25 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,21 4 5 0 0 1,2F 4 5 0 0 0,32 4 6 0 0 0,32 4 7 0 0 0,29 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,21 5 5 0 0 1,2F 5 5 0 0 0,32 5 6 0 0 0,32 5 7 0 0 0"
        << "3,29 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,A 1 5 1 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2A 2 5 1 0 0,1E 2 5 0 0 0,2A 2 6 1 0 0,1E 2 6 0 0 0,29 3 1 0 0 0,1E 3 1 0 0 0,29 3 2 0 0 0,1E 3 2 0 0 1,30 3 2 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2C 3 5 0 0 0,1E 3 5 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,25 4 1 0 0 0,1E 4 1 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,2C 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2A 4 5 1 0 0,1E 4 5 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,29 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,A 5 5 1 0 0"
        << "0,2A 2 1 1 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 0,2A 2 6 1 0 0,1E 2 6 0 0 0,2A 2 7 1 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,10 3 3 0 0 0,29 3 3 0 0 0,10 3 4 0 0 0,2C 3 4 0 0 0,10 3 5 0 0 0,E 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,E 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 3 8 0 0 0,2A 3 8 1 0 0,1E 3 8 0 0 0,10 3 9 0 0 0,2A 3 9 1 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,2C 4 4 0 0 0,10 4 5 0 0 0,E 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,E 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,10 4 8 0 0 0,2A 4 8 1 0 0,1E 4 8 0 0 0,10 4 9 0 0 0,2A 4 9 1 0 0,1E 4 9 0 0 0,2A 5 1 1 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 0,2C 5 5 0 0 0,1E 5 5 0 0 0,2A 5 6 1 0 0,1E 5 6 0 0 0,2A 5 7 1 0 0"
        << "4,21 1 1 0 0 0,29 1 1 0 0 0,1E 1 1 0 0 0,21 1 2 0 0 0,2C 1 2 0 0 0,1E 1 2 0 0 0,21 1 3 0 0 0,29 1 3 0 0 0,1E 1 3 0 0 0,21 1 4 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 0,21 2 1 0 0 0,2C 2 1 0 0 0,1E 2 1 0 0 0,21 2 2 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 0,21 2 3 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 0,21 2 4 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 0,21 2 5 0 0 0,2A 2 5 1 0 0,1E 2 5 0 0 0,21 2 6 0 0 0,2A 2 6 1 0 0,21 3 1 0 0 0,29 3 1 0 0 0,1E 3 1 0 0 0,21 3 2 0 0 0,E 3 2 0 0 0,1E 3 2 0 0 0,21 3 3 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 0,21 3 4 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 0,21 3 5 0 0 0,2C 3 5 0 0 0,1E 3 5 0 0 0,21 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,21 3 7 0 0 0,2A 3 7 1 0 0,21 4 1 0 0 0,2C 4 1 0 0 0,1E 4 1 0 0 0,21 4 2 0 0 0,25 4 2 0 0 0,1E 4 2 0 0 0,21 4 3 0 0 0,2C 4 3 0 0 0,1E 4 3 0 0 0,21 4 4 0 0 0,2A 4 4 1 0 0,1E 4 4 0 0 0,21 4 5 0 0 0,2A 4 5 1 0 0,1E 4 5 0 0 0,21 4 6 0 0 0,2A 4 6 1 0 0,21 5 1 0 0 0,29 5 1 0 0 0,1E 5 1 0 0 0,21 5 2 0 0 0,2C 5 2 0 0 0,1E 5 2 0 0 0,21 5 3 0 0 0,29 5 3 0 0 0,1E 5 3 0 0 0,21 5 4 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 0"
        << "1,1D 1 1 0 0 0,1E 1 1 0 0 0,2C 1 2 0 0 0,1E 1 2 0 0 0,1D 1 3 0 0 0,1E 1 3 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 0,A 1 5 1 0 0,1D 2 1 0 0 0,1E 2 1 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,A 2 4 1 0 0,1E 2 4 0 0 0,A 2 5 1 0 0,10 3 1 0 0 0,1D 3 1 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,10 3 3 0 0 0,29 3 3 0 0 0,10 3 4 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 0,10 3 5 0 0 0,1D 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,29 3 6 0 0 0,1E 3 6 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 0,10 4 5 0 0 0,1D 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,29 4 6 0 0 0,1E 4 6 0 0 0,1D 5 1 0 0 0,1E 5 1 0 0 0,25 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 0,A 5 5 1 0 0,1D 6 1 0 0 0,1E 6 1 0 0 0,2C 6 2 0 0 0,1E 6 2 0 0 0,1D 6 3 0 0 0,1E 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 0,A 6 5 1 0 0"
        << "3,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,29 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,2F 2 6 0 0 0,2F 3 1 0 0 0,2A 3 3 1 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,17 3 4 0 0 0,32 3 5 0 0 0,2F 3 6 0 0 0,2F 4 1 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,29 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 1,30 4 5 0 0 0,2F 4 6 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,29 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0"
        << "0,2F 1 2 0 0 0,2F 1 4 0 0 0,2F 1 6 0 0 0,2F 2 1 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,10 3 3 0 0 0,29 3 3 0 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 6 0 0 0,2F 3 6 0 0 0,10 3 7 0 0 0,10 4 1 0 0 0,E 4 1 0 0 0,10 4 2 0 0 0,25 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,E 5 1 0 0 0,2F 5 2 0 0 0,2F 5 4 0 0 0,2F 6 1 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "4,21 1 1 0 0 0,2F 1 1 0 0 0,21 1 2 0 0 0,21 1 3 0 0 0,28 1 3 0 0 0,1E 1 3 0 0 0,30 1 3 0 0 0,21 1 4 0 0 0,16 1 4 0 0 0,1E 1 4 0 0 0,30 1 4 0 0 0,21 1 5 0 0 0,1C 1 5 0 0 0,1E 1 5 0 0 0,30 1 5 0 0 0,21 1 6 0 0 0,2F 1 6 0 0 0,21 1 7 0 0 0,21 2 1 0 0 0,2F 2 1 0 0 0,21 2 2 0 0 0,21 2 3 0 0 0,28 2 3 0 0 0,1E 2 3 0 0 0,30 2 3 0 0 0,21 2 4 0 0 0,16 2 4 0 0 0,1E 2 4 0 0 0,30 2 4 0 0 0,21 2 5 0 0 0,1C 2 5 0 0 0,1E 2 5 0 0 0,30 2 5 0 0 0,21 2 6 0 0 0,2F 2 6 0 0 0,21 2 7 0 0 0,21 3 1 0 0 0,E 3 1 0 0 0,21 3 2 0 0 0,29 3 2 0 0 0,21 3 3 0 0 0,24 3 3 0 0 0,21 3 4 0 0 0,F 3 4 0 0 0,1E 3 4 0 0 0,30 3 4 0 0 0,21 3 5 0 0 0,24 3 5 0 0 0,21 3 6 0 0 0,29 3 6 0 0 0,21 3 7 0 0 0,E 3 7 0 0 0,21 4 1 0 0 0,2F 4 1 0 0 0,21 4 2 0 0 0,21 4 3 0 0 0,28 4 3 0 0 0,1E 4 3 0 0 0,30 4 3 0 0 0,21 4 4 0 0 0,16 4 4 0 0 0,1E 4 4 0 0 0,30 4 4 0 0 0,21 4 5 0 0 0,1C 4 5 0 0 0,1E 4 5 0 0 0,30 4 5 0 0 0,21 4 6 0 0 0,2F 4 6 0 0 0,21 4 7 0 0 0,21 5 1 0 0 0,2F 5 1 0 0 0,21 5 2 0 0 0,21 5 3 0 0 0,28 5 3 0 0 0,1E 5 3 0 0 0,30 5 3 0 0 0,21 5 4 0 0 0,16 5 4 0 0 0,1E 5 4 0 0 0,30 5 4 0 0 0,21 5 5 0 0 0,1C 5 5 0 0 0,1E 5 5 0 0 0,30 5 5 0 0 0,21 5 6 0 0 0,2F 5 6 0 0 0,21 5 7 0 0 0"
        << "1,7 1 1 0 0 0,1E 1 1 0 0 0,27 1 2 0 0 0,1E 1 2 0 0 0,17 1 3 0 0 0,1E 1 3 0 0 0,22 1 4 0 0 0,1E 1 4 0 0 0,2F 1 5 0 0 0,5 1 7 0 0 0,1E 1 7 0 0 0,6 1 8 0 0 0,0 2 1 0 0 0,1E 2 1 0 0 0,1D 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,12 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,20 2 7 0 0 0,1E 2 7 0 0 0,21 2 8 0 0 0,2C 2 8 0 0 0,13 3 1 0 0 0,10 3 2 0 0 0,2F 3 2 0 0 0,10 3 3 0 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 6 0 0 0,9 3 6 1 2 0,1E 3 6 0 0 0,10 3 7 0 0 0,1 3 7 0 0 0,1E 3 7 0 0 0,10 3 8 0 0 0,1E 3 8 0 0 0,10 3 9 0 0 0,1F 3 9 1 0 0,1E 3 9 0 0 0,18 4 1 1 0 0,10 4 2 0 0 0,2F 4 2 0 0 0,10 4 3 0 0 0,10 4 4 0 0 0,2F 4 4 0 0 0,10 4 5 0 0 0,2B 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,29 4 7 0 0 0,1E 4 7 0 0 0,10 4 8 0 0 0,1E 4 8 0 0 0,10 4 9 0 0 0,2D 4 9 0 0 0,1E 4 9 0 0 0,28 5 1 0 0 0,1E 5 1 0 0 0,2E 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,1A 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,21 5 7 0 0 0,2C 5 7 0 0 0,1E 5 7 0 0 0,19 5 8 0 0 0,4 5 9 0 0 0,A 6 1 1 0 0,1E 6 1 0 0 0,15 6 2 0 0 0,16 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,1C 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0,26 6 7 0 0 0,1E 6 7 0 0 0,3 6 8 0 0 0,11 6 9 0 0 0"
        << "3,2F 1 5 0 0 0,2F 2 5 0 0 0,2F 3 5 0 0 0,2F 4 5 0 0 0,2F 5 5 0 0 0"
        << "0,25 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2F 1 4 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2F 2 4 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2D 3 5 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,25 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2F 5 4 0 0 0,25 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2F 6 4 0 0 0"
        << "0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2D 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2D 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,2D 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2D 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0"
        << "0,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 0,2F 1 5 0 0 0,2A 1 7 1 0 0,1E 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 0,2F 2 5 0 0 0,2A 2 7 1 0 0,1E 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,29 3 7 0 0 0,1E 3 7 0 0 0,10 3 8 0 0 0,29 3 8 0 0 0,1E 3 8 0 0 0,10 3 9 0 0 0,17 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,29 4 7 0 0 0,1E 4 7 0 0 0,10 4 8 0 0 0,29 4 8 0 0 0,1E 4 8 0 0 0,10 4 9 0 0 0,17 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 0,2F 5 5 0 0 0,2A 5 7 1 0 0,1E 5 7 0 0 0,2F 6 1 0 0 0,2A 6 3 1 0 0,1E 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 0,2F 6 5 0 0 0,2A 6 7 1 0 0,1E 6 7 0 0 0"
        << "0,10 3 2 0 0 0,2F 3 2 0 0 0,10 3 3 0 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 6 0 0 0,E 3 6 0 0 0,10 4 2 0 0 0,2F 4 2 0 0 0,10 4 3 0 0 0,10 4 4 0 0 0,2F 4 4 0 0 0,10 4 5 0 0 0,10 4 6 0 0 0,E 4 6 0 0 0"
        << "1,2F 1 2 0 0 0,2F 2 3 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,2F 4 2 0 0 0,10 4 3 0 0 0,10 4 4 0 0 0,29 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,10 4 9 0 0 0,2A 4 9 1 0 0,1E 4 9 0 0 0,25 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 0,2A 5 5 1 0 0,2A 6 1 1 0 0,1E 6 1 0 0 0,2C 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,A 6 3 1 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 0"
        << "4,21 1 1 0 0 0,29 1 1 0 0 0,21 1 2 0 0 0,E 1 2 0 0 0,21 2 1 0 0 0,29 2 1 0 0 0,21 2 2 0 0 0,25 2 2 0 0 0,21 2 4 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,21 2 5 0 0 0,2F 2 5 0 0 0,21 2 6 0 0 0,21 3 1 0 0 0,2F 3 1 0 0 0,21 3 2 0 0 0,21 3 3 0 0 0,29 3 3 0 0 0,21 3 4 0 0 0,2F 3 4 0 0 0,21 3 5 0 0 0,21 3 6 0 0 0,2A 3 6 1 0 0,21 4 1 0 0 0,29 4 1 0 0 0,21 4 2 0 0 0,25 4 2 0 0 0,21 4 4 0 0 0,2A 4 4 1 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,21 4 5 0 0 0,2F 4 5 0 0 0,21 4 6 0 0 0,21 5 1 0 0 0,29 5 1 0 0 0,21 5 2 0 0 0,E 5 2 0 0 0"
        << "0,29 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,E 2 4 0 0 0,29 2 5 0 0 0,2F 2 6 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,29 3 5 0 0 0,13 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 4 0 0 0,2F 4 4 0 0 0,10 4 5 0 0 0,10 4 6 0 0 0,29 4 6 0 0 0,1E 4 6 0 0 0"
        << "0,2F 1 1 0 0 0,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 2 2 0 0 0,2F 2 4 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,E 3 3 0 0 0,10 3 4 0 0 0,E 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,E 4 3 0 0 0,10 4 4 0 0 0,E 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,2F 5 2 0 0 0,2F 5 4 0 0 0,2F 6 1 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0"
        << "1,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,A 1 5 1 0 0,A 1 6 1 0 0,29 2 1 0 0 0,1E 2 1 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,29 2 5 0 0 0,1E 2 5 0 0 0,2A 2 6 1 0 0,1E 2 6 0 0 0,2A 2 7 1 0 0,1E 2 7 0 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,10 3 3 0 0 0,29 3 3 0 0 0,10 3 4 0 0 0,29 3 4 0 0 0,10 3 5 0 0 0,29 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,19 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 2 0 0 0,2A 4 2 1 0 0,10 4 3 0 0 0,29 4 3 0 0 0,2B 4 4 0 0 0,10 4 5 0 0 0,2A 4 5 1 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2A 5 5 1 0 0,2E 6 1 0 0 0,2E 6 2 0 0 0,25 6 4 0 0 0,1E 6 4 0 0 0"
        << "4,21 1 1 0 0 0,2F 1 1 0 0 0,21 1 2 0 0 0,21 1 3 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,21 1 4 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,21 1 5 0 0 0,E 1 5 0 0 0,21 2 1 0 0 0,29 2 1 0 0 0,21 2 2 0 0 0,2F 2 2 0 0 0,21 2 3 0 0 0,21 2 4 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,21 2 5 0 0 0,29 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,21 3 1 0 0 0,25 3 1 0 0 0,21 3 2 0 0 0,29 3 2 0 0 0,21 3 3 0 0 0,2F 3 3 0 0 0,21 3 4 0 0 0,21 3 5 0 0 0,2A 3 5 1 0 0,1E 3 5 0 0 1,30 3 5 0 0 0,21 4 1 0 0 0,29 4 1 0 0 0,21 4 2 0 0 0,2F 4 2 0 0 0,21 4 3 0 0 0,21 4 4 0 0 0,2A 4 4 1 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,21 4 5 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 1,30 4 5 0 0 0,21 5 1 0 0 0,2F 5 1 0 0 0,21 5 2 0 0 0,21 5 3 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,21 5 4 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,21 5 5 0 0 0,E 5 5 0 0 0"
        << "2,2F 1 1 0 0 0,2F 1 3 0 0 0,2F 1 5 0 0 0,E 2 1 0 0 0,2F 2 2 0 0 0,2F 2 4 0 0 0,29 2 6 0 0 0,E 3 1 0 0 0,E 3 2 0 0 0,2F 3 3 0 0 0,29 3 5 0 0 0,29 3 6 0 0 0,E 4 1 0 0 0,2F 4 2 0 0 0,2F 4 4 0 0 0,29 4 6 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0"
        << "0,E 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,29 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,E 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,29 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 3 8 0 0 0,2A 3 8 1 0 0,1E 3 8 0 0 0,10 3 9 0 0 0,2A 3 9 1 0 0,1E 3 9 0 0 0"
        << "0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,29 3 7 0 0 0,1E 3 7 0 0 0,10 3 8 0 0 0,29 3 8 0 0 0,1E 3 8 0 0 0,10 3 9 0 0 0,2A 3 9 1 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,29 4 7 0 0 0,1E 4 7 0 0 0,10 4 8 0 0 0,29 4 8 0 0 0,1E 4 8 0 0 0,10 4 9 0 0 0,2A 4 9 1 0 0,1E 4 9 0 0 0"
        << "0,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,E 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,29 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2F 5 4 0 0 0,E 6 1 0 0 0,1E 6 1 0 0 0,25 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2F 6 4 0 0 0"
        << "0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,2F 4 4 0 0 0,10 4 5 0 0 0,10 4 6 0 0 0,2F 4 6 0 0 0,10 4 7 0 0 0,E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,29 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,29 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0,E 6 7 0 0 0"
        << "3,29 1 1 0 0 0,1E 1 1 0 0 0,25 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,29 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2A 2 1 1 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2A 2 7 1 0 0,1E 2 7 0 0 0,2F 3 1 0 0 0,2F 3 3 0 0 0,2F 3 5 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,25 3 8 0 0 0,2A 4 1 1 0 0,1E 4 1 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,25 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,29 5 1 0 0 0,1E 5 1 0 0 0,25 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,29 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0"
        << "0,25 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2F 1 4 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,A 2 5 1 0 0,A 2 6 1 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2A 3 3 1 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 6 0 0 0,2C 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2A 4 3 1 0 0,10 4 4 0 0 0,2F 4 4 0 0 0,10 4 5 0 0 0,10 4 6 0 0 0,2C 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,A 5 5 1 0 0,A 5 6 1 0 0,25 6 1 0 0 0,1E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2F 6 4 0 0 0"
        << "0,2F 1 1 0 0 0,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 2 1 0 0 0,2F 2 3 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2A 5 4 1 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2A 5 7 1 0 0,2F 6 1 0 0 0,2A 6 3 1 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,25 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0,2C 6 7 0 0 0"
        << "2,2E 1 1 0 0 0,2C 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,29 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2E 2 1 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2F 2 5 0 0 0,2E 3 1 0 0 0,2C 3 2 0 0 0,1E 3 2 0 0 1,30 3 2 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,E 3 5 0 0 0,E 3 6 0 0 0,2E 4 1 0 0 0,2C 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2F 4 5 0 0 0,2E 5 1 0 0 0,2C 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,29 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0"
        << "0,2E 1 1 0 0 0,2E 1 2 0 0 0,2C 1 4 0 0 0,2F 1 5 0 0 0,2E 2 1 0 0 0,2E 2 2 0 0 0,2C 2 4 0 0 0,25 2 5 0 0 0,2A 2 6 1 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,2E 5 1 0 0 0,2E 5 2 0 0 0,2C 5 4 0 0 0,25 5 5 0 0 0,2A 5 6 1 0 0,2E 6 1 0 0 0,2E 6 2 0 0 0,2C 6 4 0 0 0,2F 6 5 0 0 0"
        << "1,2F 1 5 0 0 0,2A 2 2 1 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,10 3 3 0 0 0,2A 3 3 1 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 6 0 0 0,2F 3 6 0 0 0,10 3 7 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,2A 4 3 1 0 0,10 4 4 0 0 0,2F 4 4 0 0 0,10 4 5 0 0 0,10 4 6 0 0 0,2F 4 6 0 0 0,10 4 7 0 0 0,2A 5 2 1 0 0,2F 5 5 0 0 0,2F 6 5 0 0 0"
        << "4,21 2 1 0 0 0,2F 2 1 0 0 0,21 2 2 0 0 0,21 2 3 0 0 0,2A 2 3 1 0 0,21 2 4 0 0 0,2F 2 4 0 0 0,21 2 5 0 0 0,21 2 6 0 0 0,2F 2 6 0 0 0,21 2 7 0 0 0,21 2 8 0 0 0,E 2 8 0 0 0,21 3 1 0 0 0,2F 3 1 0 0 0,21 3 2 0 0 0,21 3 3 0 0 0,2F 3 3 0 0 0,21 3 4 0 0 0,21 3 5 0 0 0,2F 3 5 0 0 0,21 3 6 0 0 0,21 3 7 0 0 0,2F 3 7 0 0 0,21 3 8 0 0 0,21 4 1 0 0 0,2F 4 1 0 0 0,21 4 2 0 0 0,21 4 3 0 0 0,2A 4 3 1 0 0,21 4 4 0 0 0,2F 4 4 0 0 0,21 4 5 0 0 0,21 4 6 0 0 0,2F 4 6 0 0 0,21 4 7 0 0 0,21 4 8 0 0 0,E 4 8 0 0 0"
        << "2,2F 1 1 0 0 0,2E 1 3 0 0 0,2F 1 5 0 0 0,E 2 1 0 0 0,2A 2 2 1 0 0,2E 2 3 0 0 0,29 2 5 0 0 0,29 2 6 0 0 0,2F 3 1 0 0 0,2F 3 5 0 0 0,E 4 1 0 0 0,2A 4 2 1 0 0,2E 4 3 0 0 0,29 4 5 0 0 0,29 4 6 0 0 0,2F 5 1 0 0 0,2E 5 3 0 0 0,2F 5 5 0 0 0"
        << "3,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2E 1 4 0 0 0,21 1 6 0 0 1,2F 1 6 0 0 0,32 1 7 0 0 0,32 1 8 0 0 0,32 1 9 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,25 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,21 2 6 0 0 1,2F 2 6 0 0 0,32 2 7 0 0 0,32 2 8 0 0 0,32 2 9 0 0 0,2F 3 1 0 0 0,2C 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,21 3 7 0 0 1,2F 3 7 0 0 0,32 3 8 0 0 0,32 3 9 0 0 0,2F 4 1 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0,21 4 7 0 0 1,2F 4 7 0 0 0,32 4 8 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,25 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,21 5 6 0 0 1,2F 5 6 0 0 0,32 5 7 0 0 0,32 5 8 0 0 0,32 5 9 0 0 0"
        << "0,17 1 1 0 0 0,2E 1 2 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 6 0 0 0,17 2 1 0 0 1,1E 2 1 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2E 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,2F 2 6 0 0 0,10 3 1 0 0 0,17 3 1 0 0 0,10 3 2 0 0 0,2F 3 2 0 0 0,10 3 3 0 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 6 0 0 0,2F 3 6 0 0 0,10 3 7 0 0 0,10 3 8 0 0 0,29 3 8 0 0 0,1E 3 8 0 0 0,10 4 1 0 0 0,17 4 1 0 0 1,1E 4 1 0 0 0,10 4 2 0 0 0,2F 4 2 0 0 0,10 4 3 0 0 0,10 4 4 0 0 0,2F 4 4 0 0 0,10 4 5 0 0 0,10 4 6 0 0 0,2F 4 6 0 0 0,10 4 7 0 0 0,10 4 8 0 0 0,29 4 8 0 0 0,1E 4 8 0 0 0,17 5 1 0 0 0,25 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2E 5 3 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2C 5 5 0 0 0,1E 5 5 0 0 1,30 5 5 0 0 0,2F 5 6 0 0 0,17 6 1 0 0 1,1E 6 1 0 0 0,2E 6 2 0 0 0,2A 6 3 1 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,29 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 6 0 0 0"
        << "0,2F 1 1 0 0 0,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2F 2 3 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,1D 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,25 4 3 0 0 0,10 4 4 0 0 0,2A 4 4 1 0 0,10 4 8 0 0 0,E 4 8 0 0 0,2B 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,2F 6 1 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "2"
        << "0,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,E 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,29 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,2F 6 1 0 0 0,2A 6 3 1 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2C 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2C 3 3 0 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 6 0 0 0,2F 3 6 0 0 0,10 3 7 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2C 4 3 0 0 0,10 4 4 0 0 0,2F 4 4 0 0 0,10 4 5 0 0 0,10 4 6 0 0 0,2F 4 6 0 0 0,10 4 7 0 0 0,2C 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0"
        << "4,21 1 1 0 0 0,2F 1 1 0 0 0,21 1 2 0 0 0,21 1 3 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,21 1 4 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,21 1 5 0 0 0,2C 1 5 0 0 0,1E 1 5 0 0 1,30 1 5 0 0 0,21 1 6 0 0 0,2F 1 6 0 0 0,21 1 7 0 0 0,21 2 1 0 0 0,2F 2 1 0 0 0,21 2 2 0 0 0,21 2 3 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,21 2 4 0 0 0,25 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,21 2 5 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,21 2 6 0 0 0,2F 2 6 0 0 0,21 2 7 0 0 0,21 3 1 0 0 0,2F 3 1 0 0 0,21 3 2 0 0 0,21 3 3 0 0 0,2C 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,21 3 4 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,21 3 5 0 0 0,2C 3 5 0 0 0,1E 3 5 0 0 1,30 3 5 0 0 0,21 3 6 0 0 0,2F 3 6 0 0 0,21 3 7 0 0 0,21 4 1 0 0 0,2F 4 1 0 0 0,21 4 2 0 0 0,21 4 3 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,21 4 4 0 0 0,25 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,21 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 1,30 4 5 0 0 0,21 4 6 0 0 0,2F 4 6 0 0 0,21 4 7 0 0 0,21 5 1 0 0 0,2F 5 1 0 0 0,21 5 2 0 0 0,21 5 3 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,21 5 4 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,21 5 5 0 0 0,2C 5 5 0 0 0,1E 5 5 0 0 1,30 5 5 0 0 0,21 5 6 0 0 0,2F 5 6 0 0 0,21 5 7 0 0 0"
        << "2,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2A 2 7 1 0 0,1E 2 7 0 0 1,30 2 7 0 0 0,2A 2 8 1 0 0,1E 2 8 0 0 0,2F 3 1 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 1,30 3 7 0 0 0,E 3 8 0 0 0,1E 3 8 0 0 0,2F 4 1 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 1,30 4 7 0 0 0,2A 4 8 1 0 0,1E 4 8 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0"
        << "0,2C 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2F 1 5 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2F 2 5 0 0 0,9 3 2 1 2 1,9 3 3 1 2 1,9 3 5 1 2 0,9 3 6 1 2 0,9 4 2 1 2 1,9 4 3 1 2 1,9 4 5 1 2 0,9 4 6 1 2 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2F 5 5 0 0 0,2C 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2F 6 5 0 0 0"
        << "0,2C 1 1 0 0 0,1E 1 1 0 0 0,2C 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2C 1 5 0 0 0,1E 1 5 0 0 1,30 1 5 0 0 0,2C 1 6 0 0 0,1E 1 6 0 0 1,30 1 6 0 0 0,2F 1 7 0 0 0,2C 2 1 0 0 0,1E 2 1 0 0 0,2C 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,2C 2 6 0 0 0,1E 2 6 0 0 1,30 2 6 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,29 4 9 0 0 0,1E 4 9 0 0 0,2C 5 1 0 0 0,1E 5 1 0 0 0,2C 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2C 5 5 0 0 0,1E 5 5 0 0 1,30 5 5 0 0 0,2C 5 6 0 0 0,1E 5 6 0 0 1,30 5 6 0 0 0,2F 5 7 0 0 0,2C 6 1 0 0 0,1E 6 1 0 0 0,2C 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2C 6 5 0 0 0,1E 6 5 0 0 1,30 6 5 0 0 0,2C 6 6 0 0 0,1E 6 6 0 0 1,30 6 6 0 0 0,2F 6 7 0 0 0"
        << "0,21 1 2 0 0 1,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,21 1 3 0 0 1,29 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,21 1 4 0 0 1,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,21 1 5 0 0 1,2F 1 5 0 0 0,21 2 2 0 0 1,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,21 2 3 0 0 1,25 2 3 0 0 1,1E 2 3 0 0 1,30 2 3 0 0 0,21 2 4 0 0 1,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,21 2 5 0 0 1,2F 2 5 0 0 0,10 3 1 0 0 1,2F 3 1 0 0 0,10 3 3 0 0 1,2F 3 3 0 0 0,10 3 5 0 0 1,2F 3 5 0 0 0,10 3 7 0 0 1,2F 3 7 0 0 0,10 4 1 0 0 1,2F 4 1 0 0 0,10 4 3 0 0 1,2F 4 3 0 0 0,10 4 5 0 0 1,2F 4 5 0 0 0,10 4 7 0 0 1,2F 4 7 0 0 0,21 5 2 0 0 1,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,21 5 3 0 0 1,25 5 3 0 0 1,1E 5 3 0 0 1,30 5 3 0 0 0,21 5 4 0 0 1,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,21 5 5 0 0 1,2F 5 5 0 0 0,21 6 2 0 0 1,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,21 6 3 0 0 1,29 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,21 6 4 0 0 1,2C 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,21 6 5 0 0 1,2F 6 5 0 0 0"
        << "0,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,31 2 8 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,E 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,E 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2A 5 4 1 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,2F 6 1 0 0 0,2A 6 3 1 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,29 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "0,2F 1 1 0 0 0,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2F 2 3 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,29 4 4 0 0 0,10 4 5 0 0 0,E 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,E 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,E 4 7 0 0 0,1E 4 7 0 0 0,10 4 8 0 0 0,E 4 8 0 0 0,1E 4 8 0 0 0"
        << "1,2E 1 1 0 0 0,2F 1 2 0 0 0,2F 1 4 0 0 0,2E 2 1 0 0 0,25 2 2 0 0 0,2F 2 3 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,2F 3 2 0 0 0,10 3 3 0 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 6 0 0 0,2F 3 6 0 0 0,10 3 7 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,2F 4 2 0 0 0,10 4 3 0 0 0,10 4 4 0 0 0,2F 4 4 0 0 0,10 4 5 0 0 0,10 4 6 0 0 0,2F 4 6 0 0 0,10 4 7 0 0 0,2E 5 1 0 0 0,25 5 2 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2E 6 1 0 0 0,2F 6 2 0 0 0,2F 6 4 0 0 0"
        << "4,21 1 2 0 0 0,2F 1 2 0 0 0,21 1 3 0 0 0,21 1 4 0 0 0,2F 1 4 0 0 0,21 1 5 0 0 0,21 2 1 0 0 0,2F 2 1 0 0 0,21 2 2 0 0 0,21 2 3 0 0 0,E 2 3 0 0 0,21 2 4 0 0 0,2F 2 4 0 0 0,21 2 5 0 0 0,21 2 6 0 0 0,2F 2 6 0 0 0,21 2 7 0 0 0,21 3 1 0 0 0,2F 3 1 0 0 0,21 3 2 0 0 0,21 3 3 0 0 0,2F 3 3 0 0 0,21 3 4 0 0 0,21 3 5 0 0 0,2F 3 5 0 0 0,21 3 6 0 0 0,21 3 7 0 0 0,2F 3 7 0 0 0,21 3 8 0 0 0,21 4 1 0 0 0,29 4 1 0 0 0,21 4 2 0 0 0,2F 4 2 0 0 0,21 4 3 0 0 0,21 4 4 0 0 0,2F 4 4 0 0 0,21 4 5 0 0 0,21 4 6 0 0 0,E 4 6 0 0 0,21 4 7 0 0 0,2F 4 7 0 0 0,21 4 8 0 0 0,21 5 1 0 0 0,29 5 1 0 0 0,21 5 2 0 0 0,25 5 2 0 0 0,21 5 3 0 0 0,29 5 3 0 0 0,21 5 4 0 0 0,2F 5 4 0 0 0,21 5 5 0 0 0,21 5 6 0 0 0,2F 5 6 0 0 0,21 5 7 0 0 0"
        << "0,2F 1 3 0 0 0,29 1 5 0 0 0,2F 1 6 0 0 0,2F 2 3 0 0 0,29 2 5 0 0 0,2F 2 6 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,E 3 5 0 0 0,10 3 6 0 0 0,2F 3 6 0 0 0,10 3 7 0 0 0,10 3 8 0 0 0,2F 3 8 0 0 0,10 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,E 4 5 0 0 0,10 4 6 0 0 0,2F 4 6 0 0 0,10 4 7 0 0 0,10 4 8 0 0 0,2F 4 8 0 0 0,10 4 9 0 0 0,2F 5 3 0 0 0,29 5 5 0 0 0,2F 5 6 0 0 0,2F 6 3 0 0 0,29 6 5 0 0 0,2F 6 6 0 0 0"
        << "2,2F 1 1 0 0 0,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,E 1 9 0 0 0,2F 2 1 0 0 0,2F 2 3 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,E 2 9 0 0 0,2F 3 1 0 0 0,2F 3 3 0 0 0,2F 3 5 0 0 0,2F 3 7 0 0 0,2F 4 1 0 0 0,2F 4 3 0 0 0,2F 4 5 0 0 0,2F 4 7 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0"
        << "1,2F 1 1 0 0 0,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2F 2 3 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,29 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,2F 6 1 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "5,21 1 1 0 0 0,2F 1 1 0 0 0,21 1 2 0 0 0,21 1 3 0 0 0,2F 1 3 0 0 0,21 1 4 0 0 0,21 1 5 0 0 0,2F 1 5 0 0 0,21 1 6 0 0 0,21 1 7 0 0 0,2F 1 7 0 0 0,21 1 8 0 0 0,21 2 1 0 0 0,2F 2 1 0 0 0,21 2 2 0 0 0,21 2 3 0 0 0,2F 2 3 0 0 0,21 2 4 0 0 0,21 2 5 0 0 0,2F 2 5 0 0 0,21 2 6 0 0 0,21 2 7 0 0 0,2F 2 7 0 0 0,21 2 8 0 0 0,21 3 1 0 0 0,2F 3 1 0 0 0,21 3 2 0 0 0,21 3 3 0 0 0,2F 3 3 0 0 0,21 3 4 0 0 0,21 3 5 0 0 0,2F 3 5 0 0 0,21 3 6 0 0 0,21 3 7 0 0 0,2F 3 7 0 0 0,21 3 8 0 0 0,21 4 1 0 0 0,2F 4 1 0 0 0,21 4 2 0 0 0,21 4 3 0 0 0,2F 4 3 0 0 0,21 4 4 0 0 0,21 4 5 0 0 0,2F 4 5 0 0 0,21 4 6 0 0 0,21 4 7 0 0 0,2F 4 7 0 0 0,21 4 8 0 0 0,21 5 1 0 0 0,2F 5 1 0 0 0,21 5 2 0 0 0,21 5 3 0 0 0,2F 5 3 0 0 0,21 5 4 0 0 0,21 5 5 0 0 0,2F 5 5 0 0 0,21 5 6 0 0 0,21 5 7 0 0 0,2F 5 7 0 0 0,21 5 8 0 0 0"
        << "0,2F 1 1 0 0 0,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 2 1 0 0 0,2F 2 3 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,29 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,29 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 6 1 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0"
        << "0,2F 2 1 0 0 0,2F 2 3 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,E 4 9 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0"
        << "3,28 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,28 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,28 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,16 1 5 0 0 0,28 2 1 0 0 0,1E 2 1 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,28 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,28 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,16 2 5 0 0 0,2A 2 6 1 0 0,28 3 1 0 0 0,1E 3 1 0 0 0,2A 3 2 1 0 0,1E 3 2 0 0 1,30 3 2 0 0 0,28 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,28 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,16 3 5 0 0 0,2A 3 6 1 0 0,28 4 1 0 0 0,1E 4 1 0 0 0,25 4 2 0 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,28 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,28 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,16 4 5 0 0 0,2A 4 6 1 0 0,28 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,28 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,28 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,16 5 5 0 0 0"
        << "3,2A 2 1 1 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,29 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 0,2A 2 5 1 0 0,1E 2 5 0 0 0,2A 2 6 1 0 0,29 3 1 0 0 0,1E 3 1 0 0 0,25 3 2 0 0 0,1E 3 2 0 0 1,30 3 2 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 0,2C 3 5 0 0 0,1E 3 5 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,2A 4 1 1 0 0,1E 4 1 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,29 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2A 4 4 1 0 0,1E 4 4 0 0 0,2A 4 5 1 0 0,1E 4 5 0 0 0,2A 4 6 1 0 0"
        << "1,25 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 0,28 1 3 0 0 0,1E 1 3 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 0,A 1 5 1 0 0,28 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 0,28 2 3 0 0 0,1E 2 3 0 0 0,28 2 4 0 0 0,1E 2 4 0 0 0,2A 2 5 1 0 0,1E 2 5 0 0 0,2A 2 6 1 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,29 3 3 0 0 0,10 3 4 0 0 0,29 3 4 0 0 0,10 3 5 0 0 0,29 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 3 8 0 0 0,2A 3 8 1 0 0,1E 3 8 0 0 0,10 3 9 0 0 0,2A 3 9 1 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,29 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,1E 4 6 0 0 0,10 4 8 0 0 0,2A 4 8 1 0 0,1E 4 8 0 0 0,10 4 9 0 0 0,2A 4 9 1 0 0,1E 4 9 0 0 0,25 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 0,29 5 3 0 0 0,1E 5 3 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 0,2A 5 5 1 0 0,1E 5 5 0 0 0,2A 5 6 1 0 0,28 6 1 0 0 0,1E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 0,28 6 3 0 0 0,1E 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 0,A 6 5 1 0 0"
        << "0,2A 1 1 1 0 0,1E 1 1 0 0 0,2C 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2A 2 5 1 0 0,10 3 1 0 0 0,29 3 1 0 0 0,2B 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,E 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,25 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2A 5 5 1 0 0,2A 6 1 1 0 0,1E 6 1 0 0 0,2C 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,A 6 3 1 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 0"
        << "0,2F 1 1 0 0 0,29 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,E 5 4 0 0 0,2F 5 5 0 0 0,2C 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,29 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,E 6 4 0 0 0,2F 6 5 0 0 0"
        << "0,2C 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 0,A 1 5 1 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 0,2A 2 6 1 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,29 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,E 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 3 8 0 0 0,2A 3 8 1 0 0,1E 3 8 0 0 0,10 3 9 0 0 0,2A 3 9 1 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2C 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,10 4 8 0 0 0,2A 4 8 1 0 0,1E 4 8 0 0 0,10 4 9 0 0 0,2A 4 9 1 0 0,1E 4 9 0 0 0,25 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 0,2C 5 5 0 0 0,1E 5 5 0 0 0,2A 5 6 1 0 0,2C 6 1 0 0 0,1E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 0,A 6 5 1 0 0"
        << "3,2A 1 1 1 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2A 1 5 1 0 0,1E 1 5 0 0 0,2C 1 6 0 0 0,1E 1 6 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,29 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 0,2F 2 6 0 0 0,2A 3 1 1 0 0,1E 3 1 0 0 0,29 3 2 0 0 0,1E 3 2 0 0 1,30 3 2 0 0 0,2A 3 3 1 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,29 4 1 0 0 0,1E 4 1 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,2C 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,A 4 4 1 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2A 4 5 1 0 0,1E 4 5 0 0 0,25 5 1 0 0 0,1E 5 1 0 0 0,2C 5 2 0 0 0,1E 5 2 0 0 0,A 5 3 1 0 0,1E 5 3 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 0"
        << "1,2A 1 1 1 0 0,1E 1 1 0 0 0,25 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,A 1 4 1 0 0,1E 1 4 0 0 0,A 1 5 1 0 0,29 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,A 2 4 1 0 0,1E 2 4 0 0 0,A 2 5 1 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2A 3 5 1 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,2A 3 6 1 0 0,1E 3 6 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2A 4 5 1 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,29 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 0,A 5 5 1 0 0,2A 6 1 1 0 0,1E 6 1 0 0 0,25 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 0,A 6 5 1 0 0"
        << "3,29 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2F 1 4 0 0 0,29 2 1 0 0 0,1E 2 1 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2F 2 4 0 0 0,29 3 1 0 0 0,1E 3 1 0 0 0,2A 3 2 1 0 0,1E 3 2 0 0 1,30 3 2 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 0,2A 3 5 1 0 0,1E 3 5 0 0 0"
        << "1,2F 1 2 0 0 0,2F 1 4 0 0 0,2F 1 6 0 0 0,2F 2 2 0 0 0,29 2 4 0 0 0,29 2 5 0 0 0,2F 2 6 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,29 3 3 0 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 6 0 0 0,29 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,2F 4 4 0 0 0,10 4 5 0 0 0,10 4 6 0 0 0,29 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,2F 5 2 0 0 0,29 5 4 0 0 0,29 5 5 0 0 0,2F 5 6 0 0 0,2F 6 2 0 0 0,2F 6 4 0 0 0,2F 6 6 0 0 0"
        << "0,2F 1 2 0 0 0,29 1 4 0 0 0,2F 2 1 0 0 0,29 2 3 0 0 0,2F 2 4 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,29 3 3 0 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 8 0 0 0,A 3 8 1 0 0,1E 3 8 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,2A 5 1 1 0 0,1E 5 1 0 0 0,E 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,E 5 5 0 0 0,2A 5 6 1 0 0,1E 5 6 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 0,2A 6 3 1 0 0,1E 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 0,A 6 5 1 0 0,1E 6 5 0 0 0"
        << "3,2A 1 1 1 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,25 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,29 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 3 1 0 0 0,16 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,1C 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,2A 4 1 1 0 0,1E 4 1 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,25 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0,25 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,29 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0"
        << "5,21 1 1 0 0 0,2F 1 1 0 0 0,21 1 2 0 0 0,21 1 3 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 0,21 1 4 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,21 1 5 0 0 0,2C 1 5 0 0 0,1E 1 5 0 0 1,30 1 5 0 0 0,21 1 6 0 0 0,2F 1 6 0 0 0,21 1 7 0 0 0,21 2 1 0 0 0,2C 2 1 0 0 0,1E 2 1 0 0 0,21 2 2 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,21 2 3 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,21 2 4 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,21 2 5 0 0 0,25 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,21 2 6 0 0 0,2F 2 6 0 0 0,21 2 7 0 0 0,21 3 1 0 0 0,2C 3 1 0 0 0,1E 3 1 0 0 0,21 3 2 0 0 0,29 3 2 0 0 0,1E 3 2 0 0 1,30 3 2 0 0 0,21 3 3 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,21 3 4 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,21 3 5 0 0 0,2C 3 5 0 0 0,1E 3 5 0 0 1,30 3 5 0 0 0,21 3 6 0 0 0,2F 3 6 0 0 0,21 3 7 0 0 0,21 4 1 0 0 0,2C 4 1 0 0 0,1E 4 1 0 0 0,21 4 2 0 0 0,25 4 2 0 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,21 4 3 0 0 0,2C 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,21 4 4 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,21 4 5 0 0 0,25 4 5 0 0 0,1E 4 5 0 0 1,30 4 5 0 0 0,21 4 6 0 0 0,2F 4 6 0 0 0,21 4 7 0 0 0,21 5 1 0 0 0,2F 5 1 0 0 0,21 5 2 0 0 0,21 5 3 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 0,21 5 4 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,21 5 5 0 0 0,2C 5 5 0 0 0,1E 5 5 0 0 1,30 5 5 0 0 0,21 5 6 0 0 0,2F 5 6 0 0 0,21 5 7 0 0 0"
        << "2,2A 1 1 1 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2A 3 1 1 0 0,1E 3 1 0 0 0,2A 3 2 1 0 0,1E 3 2 0 0 1,30 3 2 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,2F 4 1 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0,2A 5 1 1 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0"
        << "0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,25 3 3 0 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 6 0 0 0,2F 3 6 0 0 0,10 3 7 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,25 4 3 0 0 0,10 4 4 0 0 0,2F 4 4 0 0 0,10 4 5 0 0 0,10 4 6 0 0 0,2F 4 6 0 0 0,10 4 7 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0"
        << "1,28 1 1 0 0 0,1E 1 1 0 0 0,28 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,28 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,28 1 5 0 0 0,1E 1 5 0 0 0,28 1 6 0 0 0,1E 1 6 0 0 0,28 1 7 0 0 0,1E 1 7 0 0 0,16 1 8 0 0 0,28 2 1 0 0 0,1E 2 1 0 0 0,28 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,29 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,28 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,28 2 5 0 0 0,1E 2 5 0 0 0,28 2 6 0 0 0,1E 2 6 0 0 0,28 2 7 0 0 0,1E 2 7 0 0 0,16 2 8 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,28 5 1 0 0 0,1E 5 1 0 0 0,28 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,29 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,28 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,28 5 5 0 0 0,1E 5 5 0 0 0,28 5 6 0 0 0,1E 5 6 0 0 0,28 5 7 0 0 0,1E 5 7 0 0 0,16 5 8 0 0 0,28 6 1 0 0 0,1E 6 1 0 0 0,28 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2A 6 3 1 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,28 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,28 6 5 0 0 0,1E 6 5 0 0 0,28 6 6 0 0 0,1E 6 6 0 0 0,28 6 7 0 0 0,1E 6 7 0 0 0,16 6 8 0 0 0"
        << "0,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 2 2 0 0 0,2F 2 6 0 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,E 5 1 0 0 0,E 5 2 0 0 0,2F 5 4 0 0 0,2F 6 3 0 0 0"
        << "4,21 1 1 0 0 0,2F 1 1 0 0 0,21 1 2 0 0 0,21 1 3 0 0 0,E 1 3 0 0 0,21 1 4 0 0 0,2F 1 4 0 0 0,21 1 5 0 0 0,21 2 1 0 0 0,29 2 1 0 0 0,21 2 2 0 0 0,25 2 2 0 0 0,21 2 3 0 0 0,29 2 3 0 0 0,21 2 4 0 0 0,2F 2 4 0 0 0,21 2 5 0 0 0,21 3 1 0 0 0,2F 3 1 0 0 0,21 3 2 0 0 0,21 3 3 0 0 0,E 3 3 0 0 0,21 3 4 0 0 0,2F 3 4 0 0 0,21 3 5 0 0 0,21 4 1 0 0 0,29 4 1 0 0 0,21 4 2 0 0 0,25 4 2 0 0 0,21 4 3 0 0 0,29 4 3 0 0 0,21 4 4 0 0 0,2F 4 4 0 0 0,21 4 5 0 0 0,21 5 1 0 0 0,2F 5 1 0 0 0,21 5 2 0 0 0,21 5 3 0 0 0,E 5 3 0 0 0,21 5 4 0 0 0,2F 5 4 0 0 0,21 5 5 0 0 0"
        << "0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,E 2 4 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,29 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0"
        << "0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2A 1 7 1 0 0,1E 1 7 0 0 1,30 1 7 0 0 0,2C 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2A 2 7 1 0 0,1E 2 7 0 0 1,30 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,2C 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2A 5 7 1 0 0,1E 5 7 0 0 1,30 5 7 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0,2A 6 7 1 0 0,1E 6 7 0 0 1,30 6 7 0 0 0"
        << "0,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2C 1 5 0 0 0,1E 1 5 0 0 0,A 1 6 1 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 0,A 2 6 1 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,25 3 2 0 0 0,10 3 3 0 0 0,29 3 3 0 0 0,10 3 4 0 0 0,E 3 4 0 0 0,1E 3 4 0 0 0,2B 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,29 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,25 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,E 4 4 0 0 0,1E 4 4 0 0 0,10 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 0,A 5 5 1 0 0,1E 5 5 0 0 0,A 5 6 1 0 0,2F 6 1 0 0 0,2A 6 3 1 0 0,1E 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 0,A 6 5 1 0 0,1E 6 5 0 0 0,A 6 6 1 0 0"
        << "3,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 0,2F 2 5 0 0 0,2F 3 1 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,29 3 7 0 0 0,1E 3 7 0 0 0,29 4 1 0 0 0,1E 4 1 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,29 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0"
        << "0,28 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,28 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,16 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,28 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,28 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,16 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,29 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,E 4 9 0 0 0,1E 4 9 0 0 0,28 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,28 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,16 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,28 6 1 0 0 0,1E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,28 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,16 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "4,21 1 1 0 0 0,2F 1 1 0 0 0,21 1 2 0 0 0,21 1 3 0 0 0,2F 1 3 0 0 0,21 1 4 0 0 0,21 1 5 0 0 0,2F 1 5 0 0 0,21 1 6 0 0 0,21 1 7 0 0 0,2F 1 7 0 0 0,21 1 8 0 0 0,21 2 1 0 0 0,2F 2 1 0 0 0,21 2 2 0 0 0,21 2 3 0 0 0,2F 2 3 0 0 0,21 2 4 0 0 0,21 2 5 0 0 0,2F 2 5 0 0 0,21 2 6 0 0 0,21 2 7 0 0 0,2F 2 7 0 0 0,21 2 8 0 0 0,21 3 1 0 0 0,2F 3 1 0 0 0,21 3 2 0 0 0,21 3 3 0 0 0,2F 3 3 0 0 0,21 3 4 0 0 0,21 3 5 0 0 0,2F 3 5 0 0 0,21 3 6 0 0 0,21 3 7 0 0 0,2F 3 7 0 0 0,21 3 8 0 0 0,21 4 1 0 0 0,2F 4 1 0 0 0,21 4 2 0 0 0,21 4 3 0 0 0,E 4 3 0 0 0,21 4 4 0 0 0,2A 4 4 1 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,21 4 5 0 0 0,2A 4 5 1 0 0,1E 4 5 0 0 1,30 4 5 0 0 0,21 4 6 0 0 0,2F 4 6 0 0 0,21 4 7 0 0 0,21 5 1 0 0 0,2F 5 1 0 0 0,21 5 2 0 0 0,21 5 3 0 0 0,E 5 3 0 0 0,21 5 4 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,21 5 5 0 0 0,29 5 5 0 0 0,1E 5 5 0 0 1,30 5 5 0 0 0,21 5 6 0 0 0,2F 5 6 0 0 0,21 5 7 0 0 0"
        << "0,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,29 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,E 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2A 5 4 1 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,2F 6 1 0 0 0,2A 6 3 1 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "0,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,E 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,E 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,E 5 7 0 0 0,2F 5 8 0 0 0,2F 6 1 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "0,2A 1 1 1 0 0,1E 1 1 0 0 0,2C 1 2 0 0 0,1E 1 2 0 0 0,A 1 3 1 0 0,1E 1 3 0 0 0,A 1 4 1 0 0,A 1 5 1 0 0,25 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 0,A 2 5 1 0 0,1E 2 5 0 0 0,2A 2 6 1 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,10 3 3 0 0 0,29 3 3 0 0 0,2B 3 4 0 0 0,10 3 5 0 0 0,E 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,E 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 3 8 0 0 0,2A 3 8 1 0 0,1E 3 8 0 0 0,10 3 9 0 0 0,2A 3 9 1 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,E 4 4 0 0 0,10 4 5 0 0 0,E 4 5 0 0 0,1E 4 5 0 0 0,2B 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,10 4 8 0 0 0,2A 4 8 1 0 0,1E 4 8 0 0 0,10 4 9 0 0 0,2A 4 9 1 0 0,1E 4 9 0 0 0,25 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 0,2A 5 4 1 0 0,1E 5 4 0 0 0,A 5 5 1 0 0,1E 5 5 0 0 0,2A 5 6 1 0 0,2A 6 1 1 0 0,1E 6 1 0 0 0,2C 6 2 0 0 0,1E 6 2 0 0 0,A 6 3 1 0 0,1E 6 3 0 0 0,A 6 4 1 0 0,A 6 5 1 0 0"
        << "0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2C 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,2C 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0"
        << "0,2F 1 1 0 0 0,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 2 1 0 0 0,2F 2 3 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,29 3 7 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,29 4 7 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 6 1 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0"
        << "0,2E 1 1 0 0 0,2C 1 2 0 0 0,1E 1 2 0 0 0,2E 1 3 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 0,2E 1 5 0 0 0,2E 2 1 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 0,2E 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 0,2E 2 5 0 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,10 3 3 0 0 0,29 3 3 0 0 0,10 3 4 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 0,10 3 5 0 0 0,E 3 5 0 0 0,1E 3 5 0 0 0,2B 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 0,10 4 5 0 0 0,E 4 5 0 0 0,1E 4 5 0 0 0,2E 5 1 0 0 0,25 5 2 0 0 0,1E 5 2 0 0 0,2E 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 0,2E 5 5 0 0 0,2E 6 1 0 0 0,2C 6 2 0 0 0,1E 6 2 0 0 0,2E 6 3 0 0 0,29 6 4 0 0 0,1E 6 4 0 0 0,2E 6 5 0 0 0"
        << "0,2A 1 3 1 0 0,1E 1 3 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 0,2C 1 5 0 0 0,29 1 6 0 0 0,1E 1 6 0 0 0,2A 1 7 1 0 0,1E 1 7 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 0,2C 2 5 0 0 0,29 2 6 0 0 0,1E 2 6 0 0 0,2A 2 7 1 0 0,1E 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2C 3 5 0 0 0,10 3 6 0 0 0,2F 3 6 0 0 0,10 3 7 0 0 0,10 3 8 0 0 0,2F 3 8 0 0 0,10 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2C 4 5 0 0 0,10 4 6 0 0 0,2F 4 6 0 0 0,10 4 7 0 0 0,10 4 8 0 0 0,2F 4 8 0 0 0,10 4 9 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 0,2C 5 5 0 0 0,29 5 6 0 0 0,1E 5 6 0 0 0,2A 5 7 1 0 0,1E 5 7 0 0 0,2A 6 3 1 0 0,1E 6 3 0 0 0,29 6 4 0 0 0,1E 6 4 0 0 0,2C 6 5 0 0 0,29 6 6 0 0 0,1E 6 6 0 0 0,2A 6 7 1 0 0,1E 6 7 0 0 0"
        << "0,2F 1 1 0 0 0,29 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,E 1 4 0 0 0,1E 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2A 5 4 1 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,2F 6 1 0 0 0,29 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,E 6 4 0 0 0,1E 6 4 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "0,2C 1 1 0 0 0,2F 1 5 0 0 0,2A 2 1 1 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,2A 5 1 1 0 0,2F 5 5 0 0 0,2C 6 1 0 0 0,2F 6 5 0 0 0"
        << "2,E 1 1 0 0 0,1E 1 1 0 0 0,25 1 2 0 0 0,2E 1 3 0 0 0,2E 1 4 0 0 0,2C 1 5 0 0 0,2F 1 6 0 0 0,2A 2 1 1 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,25 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,E 2 5 0 0 0,2F 2 6 0 0 0,2F 3 1 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,2F 3 7 0 0 0,2F 4 1 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,25 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0,2F 4 7 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,31 5 8 0 0 0"
        << "2,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,2F 3 1 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,2F 3 7 0 0 0,2F 4 1 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0,2F 4 7 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0"
        << "2,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,E 1 4 0 0 0,1E 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,E 2 4 0 0 0,1E 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,2F 3 1 0 0 0,2F 3 3 0 0 0,2F 3 5 0 0 0,2F 3 7 0 0 0,2F 4 1 0 0 0,2F 4 3 0 0 0,2F 4 5 0 0 0,2F 4 7 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0"
        << "1,29 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2C 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,25 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,19 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,29 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,2C 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2C 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0"
        << "2,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,25 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,2F 3 1 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,2C 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,25 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,2C 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 0,25 4 6 0 0 0,29 5 2 0 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,29 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,E 5 5 0 0 0,1E 5 5 0 0 0,E 5 6 0 0 0"
        << "2,E 1 5 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,2F 3 1 0 0 0,2F 3 3 0 0 0,2F 3 5 0 0 0,2F 3 7 0 0 0,2F 4 1 0 0 0,2F 4 3 0 0 0,2F 4 5 0 0 0,2F 4 7 0 0 0,E 5 5 0 0 0"
        << "0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2A 3 3 1 0 0,10 3 4 0 0 0,2C 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2A 4 3 1 0 0,10 4 4 0 0 0,2C 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0"
        << "0,22 1 1 0 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,22 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,22 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,22 1 5 0 0 0,2F 1 6 0 0 0,22 2 1 0 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,22 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,22 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,22 2 5 0 0 0,2F 2 6 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,29 3 5 0 0 0,10 3 6 0 0 0,E 3 6 0 0 0,10 3 7 0 0 0,29 3 7 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,10 4 6 0 0 0,E 4 6 0 0 0,10 4 7 0 0 0,29 4 7 0 0 0,22 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,22 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,22 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,22 5 5 0 0 0,2F 5 6 0 0 0,22 6 1 0 0 0,1E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,22 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,22 6 4 0 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,22 6 5 0 0 0,2F 6 6 0 0 0"
        << "0,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,E 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,29 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,2F 6 1 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,E 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,E 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,2F 6 1 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "2,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,E 2 4 0 0 0,1E 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,2F 3 1 0 0 0,2F 3 3 0 0 0,2F 3 5 0 0 0,2F 3 7 0 0 0,2F 4 1 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,E 4 4 0 0 0,1E 4 4 0 0 0,2F 4 5 0 0 0,2F 4 7 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0"
        << "0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2A 2 5 1 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,29 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,29 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,2A 3 7 1 0 0,1E 3 7 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,29 4 6 0 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,25 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2A 5 5 1 0 0"
        << "3,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,25 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2C 1 5 0 0 0,1E 1 5 0 0 1,30 1 5 0 0 0,2F 1 6 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,29 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,2F 2 6 0 0 0,2F 3 1 0 0 0,29 3 3 0 0 0,1E 3 3 0 0 1,30 3 3 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 1,30 3 4 0 0 0,2F 3 5 0 0 0,2F 3 7 0 0 0,31 3 8 0 0 0,2F 4 1 0 0 0,2A 4 3 1 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,25 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,2F 4 5 0 0 0,2F 4 7 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2A 5 4 1 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0"
        << "0,E 1 2 0 0 0,E 1 5 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,29 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,29 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0"
        << "0,E 1 1 0 0 0,1E 1 1 0 0 0,25 1 2 0 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,29 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2F 1 4 0 0 0,2A 2 1 1 0 0,1E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2F 2 4 0 0 0,2A 5 1 1 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 1,30 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2F 5 4 0 0 0,29 6 1 0 0 0,1E 6 1 0 0 0,25 6 2 0 0 0,1E 6 2 0 0 1,30 6 2 0 0 0,29 6 3 0 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2F 6 4 0 0 0"
        << "0,2A 1 1 1 0 0,1E 1 1 0 0 0,2A 1 2 1 0 0,1E 1 2 0 0 1,30 1 2 0 0 0,2C 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2C 1 5 0 0 0,1E 1 5 0 0 0,A 1 6 1 0 0,1E 1 6 0 0 0,A 1 7 1 0 0,2C 2 1 0 0 0,1E 2 1 0 0 0,25 2 2 0 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2C 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2C 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 0,2C 2 6 0 0 0,1E 2 6 0 0 0,2A 2 7 1 0 0,1E 2 7 0 0 0,2A 2 8 1 0 0,10 3 1 0 0 0,29 3 1 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,10 3 3 0 0 0,29 3 3 0 0 0,10 3 4 0 0 0,29 3 4 0 0 0,1E 3 4 0 0 0,10 3 5 0 0 0,29 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,29 3 6 0 0 0,1E 3 6 0 0 0,10 3 7 0 0 0,29 3 7 0 0 0,1E 3 7 0 0 0,10 3 8 0 0 0,2A 3 8 1 0 0,1E 3 8 0 0 0,10 3 9 0 0 0,2A 3 9 1 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,E 4 1 0 0 1,10 4 2 0 0 0,E 4 2 0 0 1,10 4 3 0 0 0,E 4 3 0 0 0,10 4 4 0 0 0,E 4 4 0 0 0,10 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,2A 4 6 1 0 0,1E 4 6 0 0 0,10 4 7 0 0 0,2A 4 7 1 0 0,1E 4 7 0 0 0,25 5 1 0 0 0,1E 5 1 0 0 0,2A 5 2 1 0 0,1E 5 2 0 0 0,2C 5 3 0 0 0,1E 5 3 0 0 0,A 5 4 1 0 0,1E 5 4 0 0 0,2A 5 5 1 0 0,2C 6 1 0 0 0,1E 6 1 0 0 0,2A 6 2 1 0 0,1E 6 2 0 0 0,A 6 3 1 0 0,1E 6 3 0 0 0,A 6 4 1 0 0,1E 6 4 0 0 0"
        << "0,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 1 7 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 3 9 0 0 0,E 3 9 0 0 0,1E 3 9 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,10 4 9 0 0 0,E 4 9 0 0 0,1E 4 9 0 0 0,2F 5 1 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0,2F 5 7 0 0 0,2F 6 1 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0,2F 6 7 0 0 0"
        << "2,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,29 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,E 2 1 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,2F 2 5 0 0 0,2F 3 1 0 0 0,2F 3 5 0 0 0,E 4 1 0 0 0,2A 4 2 1 0 0,1E 4 2 0 0 1,30 4 2 0 0 0,2F 4 5 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,29 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0"
        << "5,21 1 1 0 0 0,2F 1 1 0 0 0,21 1 2 0 0 0,21 1 3 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,21 1 4 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,21 1 5 0 0 0,2C 1 5 0 0 0,1E 1 5 0 0 1,30 1 5 0 0 0,21 1 6 0 0 0,2F 1 6 0 0 0,21 1 7 0 0 0,21 2 1 0 0 0,2F 2 1 0 0 0,21 2 2 0 0 0,21 2 3 0 0 0,29 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,21 2 4 0 0 0,25 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,21 2 5 0 0 0,2C 2 5 0 0 0,1E 2 5 0 0 1,30 2 5 0 0 0,21 2 6 0 0 0,2F 2 6 0 0 0,21 2 7 0 0 0,21 3 1 0 0 0,A 3 1 1 0 0,1E 3 1 0 0 0,21 3 2 0 0 0,6 3 2 0 0 0,1E 3 2 0 0 0,21 4 1 0 0 0,2F 4 1 0 0 0,21 4 2 0 0 0,21 4 3 0 0 0,29 4 3 0 0 0,1E 4 3 0 0 1,30 4 3 0 0 0,21 4 4 0 0 0,25 4 4 0 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,21 4 5 0 0 0,2C 4 5 0 0 0,1E 4 5 0 0 1,30 4 5 0 0 0,21 4 6 0 0 0,2F 4 6 0 0 0,21 4 7 0 0 0,21 5 1 0 0 0,2F 5 1 0 0 0,21 5 2 0 0 0,21 5 3 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,21 5 4 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,21 5 5 0 0 0,2C 5 5 0 0 0,1E 5 5 0 0 1,30 5 5 0 0 0,21 5 6 0 0 0,2F 5 6 0 0 0,21 5 7 0 0 0"
        << "0,2F 1 1 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2A 1 4 1 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 5 0 0 0,2F 2 1 0 0 0,2A 2 3 1 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,10 3 1 0 0 0,29 3 1 0 0 0,1E 3 1 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,1E 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,29 3 5 0 0 0,1E 3 5 0 0 0,10 3 6 0 0 0,29 3 6 0 0 0,1E 3 6 0 0 0,10 4 1 0 0 0,29 4 1 0 0 0,1E 4 1 0 0 0,10 4 2 0 0 0,29 4 2 0 0 0,1E 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,1E 4 5 0 0 0,10 4 6 0 0 0,29 4 6 0 0 0,1E 4 6 0 0 0,2F 5 1 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,2A 5 4 1 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,2F 6 1 0 0 0,2A 6 3 1 0 0,1E 6 3 0 0 1,30 6 3 0 0 0,2A 6 4 1 0 0,1E 6 4 0 0 1,30 6 4 0 0 0,2F 6 5 0 0 0"
        << "4,21 1 1 0 0 0,2F 1 1 0 0 0,21 1 2 0 0 0,21 1 3 0 0 0,2A 1 3 1 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,21 1 4 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,21 1 5 0 0 0,29 1 5 0 0 0,1E 1 5 0 0 1,30 1 5 0 0 0,21 2 1 0 0 0,25 2 1 0 0 0,21 2 2 0 0 0,2F 2 2 0 0 0,21 2 3 0 0 0,21 2 4 0 0 0,2A 2 4 1 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,21 2 5 0 0 0,E 2 5 0 0 0,1E 2 5 0 0 0,21 3 1 0 0 0,2F 3 1 0 0 0,21 3 2 0 0 0,21 3 3 0 0 0,2F 3 3 0 0 0,21 3 4 0 0 0,21 3 5 0 0 0,2A 3 5 1 0 0,1E 3 5 0 0 1,30 3 5 0 0 0,21 4 1 0 0 0,25 4 1 0 0 0,21 4 2 0 0 0,2F 4 2 0 0 0,21 4 3 0 0 0,21 4 4 0 0 0,2A 4 4 1 0 0,1E 4 4 0 0 1,30 4 4 0 0 0,21 4 5 0 0 0,E 4 5 0 0 0,1E 4 5 0 0 0,21 5 1 0 0 0,2F 5 1 0 0 0,21 5 2 0 0 0,21 5 3 0 0 0,2A 5 3 1 0 0,1E 5 3 0 0 1,30 5 3 0 0 0,21 5 4 0 0 0,2C 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,21 5 5 0 0 0,29 5 5 0 0 0,1E 5 5 0 0 1,30 5 5 0 0 0"
        << "4,21 1 3 0 0 0,2F 1 3 0 0 0,21 1 4 0 0 0,21 2 2 0 0 0,2F 2 2 0 0 0,21 2 3 0 0 0,21 2 4 0 0 0,29 2 4 0 0 0,21 2 5 0 0 0,2F 2 5 0 0 0,21 2 6 0 0 0,21 3 1 0 0 0,2F 3 1 0 0 0,21 3 2 0 0 0,21 3 3 0 0 0,29 3 3 0 0 0,21 3 4 0 0 0,25 3 4 0 0 0,21 3 5 0 0 0,29 3 5 0 0 0,21 3 6 0 0 0,2F 3 6 0 0 0,21 3 7 0 0 0,21 4 2 0 0 0,2F 4 2 0 0 0,21 4 3 0 0 0,21 4 4 0 0 0,29 4 4 0 0 0,21 4 5 0 0 0,2F 4 5 0 0 0,21 4 6 0 0 0,21 5 4 0 0 0,2F 5 4 0 0 0,21 5 5 0 0 0"
        << "0,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 2 2 0 0 0,29 2 4 0 0 0,E 2 5 0 0 0,2F 2 6 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,E 3 3 0 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 3 6 0 0 0,29 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,2F 4 4 0 0 0,10 4 5 0 0 0,10 4 6 0 0 0,E 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,2F 5 2 0 0 0,E 5 4 0 0 0,29 5 5 0 0 0,2F 5 6 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0"
        << "1,2F 1 1 0 0 0,2F 1 5 0 0 0,2F 2 2 0 0 0,2F 2 4 0 0 0,10 3 1 0 0 0,2F 3 1 0 0 0,10 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,29 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,2F 5 1 0 0 0,29 5 3 0 0 0,29 5 4 0 0 0,2F 5 5 0 0 0,2F 6 1 0 0 0,2F 6 3 0 0 0,2F 6 5 0 0 0"
        << "0,2F 1 3 0 0 0,2F 2 1 0 0 0,2F 2 3 0 0 0,2F 2 5 0 0 0,10 3 2 0 0 0,2F 3 2 0 0 0,10 3 3 0 0 0,10 3 4 0 0 0,2F 3 4 0 0 0,10 3 5 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,2F 4 3 0 0 0,10 4 4 0 0 0,10 4 5 0 0 0,2F 4 5 0 0 0,10 4 6 0 0 0,29 5 2 0 0 0,2F 5 3 0 0 0,E 5 5 0 0 0,29 6 2 0 0 0,29 6 3 0 0 0,E 6 4 0 0 0,E 6 5 0 0 0"
        << "0,21 1 4 0 0 0,1D 1 4 0 0 0,21 2 3 0 0 0,2A 2 3 1 0 0,21 2 4 0 0 0,25 2 4 0 0 0,21 2 5 0 0 0,2A 2 5 1 0 0,10 3 2 0 0 0,2F 3 2 0 0 0,10 3 3 0 0 0,10 3 4 0 0 0,29 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 4 1 0 0 0,2F 4 1 0 0 0,10 4 2 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,29 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,10 4 6 0 0 0,2F 4 6 0 0 0,10 4 7 0 0 0,2F 5 2 0 0 0,21 5 4 0 0 0,25 5 4 0 0 0,2F 5 5 0 0 0,2F 6 1 0 0 0,21 6 3 0 0 0,E 6 3 0 0 0,21 6 4 0 0 0,E 6 4 0 0 0,21 6 5 0 0 0,E 6 5 0 0 0,2F 6 6 0 0 0"
        << "0,21 1 5 0 0 0,1D 1 5 0 0 0,21 2 4 0 0 0,2A 2 4 1 0 0,21 2 5 0 0 0,25 2 5 0 0 0,21 2 6 0 0 0,2A 2 6 1 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,29 3 5 0 0 0,10 3 6 0 0 0,2F 3 6 0 0 0,10 3 7 0 0 0,10 4 2 0 0 0,2F 4 2 0 0 0,10 4 3 0 0 0,10 4 4 0 0 0,29 4 4 0 0 0,10 4 5 0 0 0,29 4 5 0 0 0,10 4 6 0 0 0,29 4 6 0 0 0,10 4 7 0 0 0,2F 4 7 0 0 0,10 4 8 0 0 0,2F 5 3 0 0 0,21 5 5 0 0 0,25 5 5 0 0 0,2F 5 6 0 0 0,2F 6 2 0 0 0,21 6 4 0 0 0,E 6 4 0 0 0,21 6 5 0 0 0,E 6 5 0 0 0,21 6 6 0 0 0,E 6 6 0 0 0,2F 6 7 0 0 0"
        << "2,2F 1 3 0 0 0,2F 1 5 0 0 0,2F 2 2 0 0 0,2F 2 4 0 0 0,2F 2 6 0 0 0,2F 3 1 0 0 0,2F 3 3 0 0 0,2F 3 5 0 0 0,2F 3 7 0 0 0,E 4 1 0 0 0,2F 4 2 0 0 0,2F 4 4 0 0 0,2F 4 6 0 0 0,E 5 1 0 0 0,E 5 2 0 0 0,2F 5 3 0 0 0,2F 5 5 0 0 0"
        << "0,29 1 3 0 0 0,1E 1 3 0 0 1,30 1 3 0 0 0,2C 1 4 0 0 0,1E 1 4 0 0 1,30 1 4 0 0 0,2F 1 6 0 0 0,2A 2 2 1 0 0,1E 2 2 0 0 1,30 2 2 0 0 0,25 2 3 0 0 0,1E 2 3 0 0 1,30 2 3 0 0 0,29 2 4 0 0 0,1E 2 4 0 0 1,30 2 4 0 0 0,2F 2 5 0 0 0,2F 2 7 0 0 0,10 3 2 0 0 0,29 3 2 0 0 0,10 3 3 0 0 0,2F 3 3 0 0 0,10 3 4 0 0 0,10 3 5 0 0 0,2F 3 5 0 0 0,10 3 6 0 0 0,10 3 7 0 0 0,2F 3 7 0 0 0,10 3 8 0 0 0,10 4 3 0 0 0,29 4 3 0 0 0,10 4 4 0 0 0,2F 4 4 0 0 0,10 4 5 0 0 0,10 4 6 0 0 0,2F 4 6 0 0 0,10 4 7 0 0 0,25 5 4 0 0 0,1E 5 4 0 0 1,30 5 4 0 0 0,2F 5 5 0 0 0,E 6 5 0 0 0";
}

} // namespace Pt
